adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- File naming: <vendor>_<part/series name>_svd.xml -->
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Nordic Semiconductor</vendor>
  <vendorID>Nordic</vendorID>
  <name>nrf54lilium_network</name>
  <series>nrf54</series>
  <version>1</version>
  <description>nRFXX reference description for system-on-chip with dual ARM 32-bit Cortex-M33 microcontrollers</description>
  <licenseText>
Copyright (c) 2010 - 2020, Nordic Semiconductor ASA

All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form, except as embedded into a Nordic
   Semiconductor ASA integrated circuit in a product or a software update for
   such product, must reproduce the above copyright notice, this list of
   conditions and the following disclaimer in the documentation and/or other
   materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

4. This software, with or without modification, must only be used with a
   Nordic Semiconductor ASA integrated circuit.

5. Any software provided in binary form under this license must not be reverse
   engineered, decompiled, modified and/or disassembled.

THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
      </licenseText>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <cpu>
    <name>CM33</name>
    <revision>r0p4</revision>
    <endian>little</endian>
    <mpuPresent>1</mpuPresent>
    <fpuPresent>0</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>0</vendorSystickConfig>
    <deviceNumInterrupts>30</deviceNumInterrupts>
    <sauNumRegions>0</sauNumRegions>
  </cpu>
  <headerSystemFilename>system_lilium_network</headerSystemFilename>
  <headerDefinitionsPrefix>NRF_</headerDefinitionsPrefix>
  <vendorExtensions>
    <MaxInterrupts>129</MaxInterrupts>
  </vendorExtensions>
  <peripherals>
    <peripheral>
      <name>RADIO</name>
      <description>2.4 GHz radio 2.4 GHz radio</description>
      <baseAddress>0x41008000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>RADIO</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_TXEN</name>
          <description>Enable RADIO in TX mode</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_TXEN</name>
              <description>Enable RADIO in TX mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_RXEN</name>
          <description>Enable RADIO in RX mode</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_RXEN</name>
              <description>Enable RADIO in RX mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_START</name>
          <description>Start RADIO</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_START</name>
              <description>Start RADIO</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stop RADIO</description>
          <addressOffset>0x00C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STOP</name>
              <description>Stop RADIO</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DISABLE</name>
          <description>Disable RADIO</description>
          <addressOffset>0x010</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_DISABLE</name>
              <description>Disable RADIO</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_RSSISTART</name>
          <description>Start the RSSI and take one single sample of the receive signal strength</description>
          <addressOffset>0x014</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_RSSISTART</name>
              <description>Start the RSSI and take one single sample of the receive signal strength</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_BCSTART</name>
          <description>Start the bit counter</description>
          <addressOffset>0x018</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_BCSTART</name>
              <description>Start the bit counter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_BCSTOP</name>
          <description>Stop the bit counter</description>
          <addressOffset>0x01C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_BCSTOP</name>
              <description>Stop the bit counter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_EDSTART</name>
          <description>Start the energy detect measurement used in IEEE 802.15.4 mode</description>
          <addressOffset>0x020</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_EDSTART</name>
              <description>Start the energy detect measurement used in IEEE 802.15.4 mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_EDSTOP</name>
          <description>Stop the energy detect measurement</description>
          <addressOffset>0x024</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_EDSTOP</name>
              <description>Stop the energy detect measurement</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_CCASTART</name>
          <description>Start the clear channel assessment used in IEEE 802.15.4 mode</description>
          <addressOffset>0x028</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_CCASTART</name>
              <description>Start the clear channel assessment used in IEEE 802.15.4 mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_CCASTOP</name>
          <description>Stop the clear channel assessment</description>
          <addressOffset>0x02C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_CCASTOP</name>
              <description>Stop the clear channel assessment</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DFESTART</name>
          <description>Start DFE operation</description>
          <addressOffset>0x030</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_DFESTART</name>
              <description>Start DFE operation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DFESTOP</name>
          <description>Stop DFE operation</description>
          <addressOffset>0x034</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_DFESTOP</name>
              <description>Stop DFE operation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_ACQINJ0DMASTART</name>
          <description>Start DMA transaction</description>
          <addressOffset>0x038</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_ACQINJ0DMASTART</name>
              <description>Start DMA transaction</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_ACQINJ0DMASTOP</name>
          <description>Stop ongoing DMA transaction</description>
          <addressOffset>0x03C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_ACQINJ0DMASTOP</name>
              <description>Stop ongoing DMA transaction</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_ACQINJ1DMASTART</name>
          <description>Start DMA transaction</description>
          <addressOffset>0x040</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_ACQINJ1DMASTART</name>
              <description>Start DMA transaction</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_ACQINJ1DMASTOP</name>
          <description>Stop ongoing DMA transaction</description>
          <addressOffset>0x044</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_ACQINJ1DMASTOP</name>
              <description>Stop ongoing DMA transaction</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_CNTPSTART</name>
          <description>Start packet counter</description>
          <addressOffset>0x048</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_CNTPSTART</name>
              <description>Start packet counter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_CNTPSTOP</name>
          <description>Stop packet counter</description>
          <addressOffset>0x04C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_CNTPSTOP</name>
              <description>Stop packet counter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_CNTPCLEAR</name>
          <description>Clear packet counter</description>
          <addressOffset>0x050</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_CNTPCLEAR</name>
              <description>Clear packet counter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_LOOPBACKEN</name>
          <description>Enable RADIO in LOOPBACK mode</description>
          <addressOffset>0x054</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_LOOPBACKEN</name>
              <description>Enable RADIO in LOOPBACK mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_CALSTART</name>
          <description>Start calibration</description>
          <addressOffset>0x058</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_CALSTART</name>
              <description>Start calibration</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_CALSTOP</name>
          <description>Stop calibration</description>
          <addressOffset>0x05C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_CALSTOP</name>
              <description>Stop calibration</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_PATESTSTART</name>
          <description>Start PA test</description>
          <addressOffset>0x060</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_PATESTSTART</name>
              <description>Start PA test</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_PATESTSTOP</name>
          <description>Stop PA test</description>
          <addressOffset>0x064</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_PATESTSTOP</name>
              <description>Stop PA test</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_CHNOINCR</name>
          <description>Update RADIO channel based on the current channel and increment it according to chNoIncrStep</description>
          <addressOffset>0x068</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_CHNOINCR</name>
              <description>Update RADIO channel based on the current channel and increment it according to chNoIncrStep</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
