adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>TASKS_DMASTART</name>
          <description>Start RADIO DMA transaction</description>
          <addressOffset>0x06C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_DMASTART</name>
              <description>Start RADIO DMA transaction</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DMASTOP</name>
          <description>Stop ongoing RADIO DMA transaction</description>
          <addressOffset>0x070</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_DMASTOP</name>
              <description>Stop ongoing RADIO DMA transaction</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DFEDMASTART</name>
          <description>Start DFE DMA transaction</description>
          <addressOffset>0x074</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_DFEDMASTART</name>
              <description>Start DFE DMA transaction</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DFEDMASTOP</name>
          <description>Stop ongoing DFE DMA transaction</description>
          <addressOffset>0x078</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_DFEDMASTOP</name>
              <description>Stop ongoing DFE DMA transaction</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_RESERVED_31</name>
          <description>UNUSED_31</description>
          <addressOffset>0x07C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_RESERVED_31</name>
              <description>UNUSED_31</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_GETNEXTDETECT</name>
          <description>Pull the last item out of the detect FIFO</description>
          <addressOffset>0x080</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_GETNEXTDETECT</name>
              <description>Pull the last item out of the detect FIFO</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_CLEARDETECTFIFO</name>
          <description>Clear the detect FIFO</description>
          <addressOffset>0x084</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_CLEARDETECTFIFO</name>
              <description>Clear the detect FIFO</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_RESETDEMODCTRL</name>
          <description>Sets all things back to original state in RxDemodCtrl</description>
          <addressOffset>0x088</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_RESETDEMODCTRL</name>
              <description>Sets all things back to original state in RxDemodCtrl</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DEMODCTRLSTARTTIMER</name>
          <description>Start the built-in custom timer. When starting the timer, it always starts from 0</description>
          <addressOffset>0x08C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_DEMODCTRLSTARTTIMER</name>
              <description>Start the built-in custom timer. When starting the timer, it always starts from 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DEMODCTRLSTOPTIMER</name>
          <description>Stop the built-in custom timer. When stopping the timer, it is always cleared afterwards</description>
          <addressOffset>0x090</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_DEMODCTRLSTOPTIMER</name>
              <description>Stop the built-in custom timer. When stopping the timer, it is always cleared afterwards</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DEMODCTRLCONDEN0</name>
          <description>Enable condition 0. After this task has been triggered, the condition will trigger exactly once</description>
          <addressOffset>0x094</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_DEMODCTRLCONDEN0</name>
              <description>Enable condition 0. After this task has been triggered, the condition will trigger exactly once</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DEMODCTRLCONDEN1</name>
          <description>Enable condition 1. After this task has been triggered, the condition will trigger exactly once</description>
          <addressOffset>0x098</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_DEMODCTRLCONDEN1</name>
              <description>Enable condition 1. After this task has been triggered, the condition will trigger exactly once</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DEMODCTRLCONDEN2</name>
          <description>Enable condition 2. After this task has been triggered, the condition will trigger exactly once</description>
          <addressOffset>0x09C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_DEMODCTRLCONDEN2</name>
              <description>Enable condition 2. After this task has been triggered, the condition will trigger exactly once</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_READY</name>
          <description>RADIO has ramped up and is ready to be started</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_READY</name>
              <description>RADIO has ramped up and is ready to be started</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_TXREADY</name>
          <description>RADIO has ramped up and is ready to be started TX path</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_TXREADY</name>
              <description>RADIO has ramped up and is ready to be started TX path</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_RXREADY</name>
          <description>RADIO has ramped up and is ready to be started RX path</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_RXREADY</name>
              <description>RADIO has ramped up and is ready to be started RX path</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_ADDRESS</name>
          <description>Address sent or received</description>
          <addressOffset>0x10C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_ADDRESS</name>
              <description>Address sent or received</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_FRAMESTART</name>
          <description>IEEE 802.15.4 length field received</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_FRAMESTART</name>
              <description>IEEE 802.15.4 length field received</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_PAYLOAD</name>
          <description>Packet payload sent or received</description>
          <addressOffset>0x114</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_PAYLOAD</name>
              <description>Packet payload sent or received</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_END</name>
          <description>Packet sent or received</description>
          <addressOffset>0x118</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_END</name>
              <description>Packet sent or received</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_PHYEND</name>
          <description>The last bit is sent on air or last bit is received</description>
          <addressOffset>0x11C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_PHYEND</name>
              <description>The last bit is sent on air or last bit is received</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_DISABLED</name>
          <description>RADIO has been disabled</description>
          <addressOffset>0x120</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_DISABLED</name>
              <description>RADIO has been disabled</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_DEVMATCH</name>
          <description>A device address match occurred on the last received packet</description>
          <addressOffset>0x124</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_DEVMATCH</name>
              <description>A device address match occurred on the last received packet</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_DEVMISS</name>
          <description>No device address match occurred on the last received packet</description>
          <addressOffset>0x128</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_DEVMISS</name>
              <description>No device address match occurred on the last received packet</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_CRCOK</name>
          <description>Packet received with CRC ok</description>
          <addressOffset>0x12C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_CRCOK</name>
              <description>Packet received with CRC ok</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_CRCERROR</name>
          <description>Packet received with CRC error</description>
          <addressOffset>0x130</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_CRCERROR</name>
              <description>Packet received with CRC error</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
