adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>EVENTS_RESERVED_13</name>
          <description>UNUSED_13</description>
          <addressOffset>0x134</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_RESERVED_13</name>
              <description>UNUSED_13</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_BCMATCH</name>
          <description>Bit counter reached bit count value</description>
          <addressOffset>0x138</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_BCMATCH</name>
              <description>Bit counter reached bit count value</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_EDEND</name>
          <description>Sampling of energy detection complete. A new ED sample is ready for readout from the RADIO.EDSAMPLE register.</description>
          <addressOffset>0x13C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_EDEND</name>
              <description>Sampling of energy detection complete. A new ED sample is ready for readout from the RADIO.EDSAMPLE register.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_EDSTOPPED</name>
          <description>The sampling of energy detection has stopped</description>
          <addressOffset>0x140</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_EDSTOPPED</name>
              <description>The sampling of energy detection has stopped</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_CCAIDLE</name>
          <description>Wireless medium in idle - clear to send</description>
          <addressOffset>0x144</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_CCAIDLE</name>
              <description>Wireless medium in idle - clear to send</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_CCABUSY</name>
          <description>Wireless medium busy - do not send</description>
          <addressOffset>0x148</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_CCABUSY</name>
              <description>Wireless medium busy - do not send</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_CCASTOPPED</name>
          <description>The CCA has stopped</description>
          <addressOffset>0x14C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_CCASTOPPED</name>
              <description>The CCA has stopped</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_RATEBOOST</name>
          <description>Ble_LR CI field received, receive mode is changed from Ble_LR125Kbit to Ble_LR500Kbit</description>
          <addressOffset>0x150</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_RATEBOOST</name>
              <description>Ble_LR CI field received, receive mode is changed from Ble_LR125Kbit to Ble_LR500Kbit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_MHRMATCH</name>
          <description>MAC header match found</description>
          <addressOffset>0x154</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_MHRMATCH</name>
              <description>MAC header match found</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_SYNC</name>
          <description>Initial sync detected</description>
          <addressOffset>0x158</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_SYNC</name>
              <description>Initial sync detected</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_CTEPRESENT</name>
          <description>CTEInfo byte is received</description>
          <addressOffset>0x15C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_CTEPRESENT</name>
              <description>CTEInfo byte is received</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_CTEWARNING</name>
          <description>CTEInfo byte received, but contain illegal CTETime or CTEType.</description>
          <addressOffset>0x160</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_CTEWARNING</name>
              <description>CTEInfo byte received, but contain illegal CTETime or CTEType.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_DFEEND</name>
          <description>DFE operation has ended</description>
          <addressOffset>0x164</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_DFEEND</name>
              <description>DFE operation has ended</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_MODEWRITTEN</name>
          <description>Generated on write access to MODE register</description>
          <addressOffset>0x168</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_MODEWRITTEN</name>
              <description>Generated on write access to MODE register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_MODEREADY</name>
          <description>Generated immediately on write access to MODE register when MODEPROGENABLE==0, otherwise only manually triggered (SELECT_EVENTS_TRIGGERS=1)</description>
          <addressOffset>0x16C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_MODEREADY</name>
              <description>Generated immediately on write access to MODE register when MODEPROGENABLE==0, otherwise only manually triggered (SELECT_EVENTS_TRIGGERS=1)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_CTEEND</name>
          <description>CTE end</description>
          <addressOffset>0x170</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_CTEEND</name>
              <description>CTE end</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_LBREADY</name>
          <description>RADIO is ready in loopback mode and is able to transmit and receive data</description>
          <addressOffset>0x174</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_LBREADY</name>
              <description>RADIO is ready in loopback mode and is able to transmit and receive data</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_CALDONE</name>
          <description>RADIO calibration is done</description>
          <addressOffset>0x178</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_CALDONE</name>
              <description>RADIO calibration is done</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_CHNOUPDATED</name>
          <description>RADIO channel no. is updated</description>
          <addressOffset>0x17C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_CHNOUPDATED</name>
              <description>RADIO channel no. is updated</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_DBCTIMEOUT</name>
          <description>DBC timeout to be able to resync</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_DBCTIMEOUT</name>
              <description>DBC timeout to be able to resync</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_TXTIMERMATCH</name>
          <description>Tx timer match</description>
          <addressOffset>0x184</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_TXTIMERMATCH</name>
              <description>Tx timer match</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_RXTIMERMATCH</name>
          <description>Rx timer match</description>
          <addressOffset>0x188</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_RXTIMERMATCH</name>
              <description>Rx timer match</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_RESERVED_35</name>
          <description>UNUSED_35</description>
          <addressOffset>0x18C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_RESERVED_35</name>
              <description>UNUSED_35</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_RXDIGEN</name>
          <description>RXDIGEN was set high from the HW timing engine</description>
          <addressOffset>0x190</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_RXDIGEN</name>
              <description>RXDIGEN was set high from the HW timing engine</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
