adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>EVENTS_RAWDETECT</name>
          <description>The double correlator detected one peak</description>
          <addressOffset>0x194</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_RAWDETECT</name>
              <description>The double correlator detected one peak</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_DETECTFIFOFULL</name>
          <description>The detect FIFO is full. This should not happen if the FIFO is sized well enough</description>
          <addressOffset>0x198</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_DETECTFIFOFULL</name>
              <description>The detect FIFO is full. This should not happen if the FIFO is sized well enough</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_TIMERWRAPS</name>
          <description>Event triggering when the timer wraps around. This is useful if one wants to count longer than the HW timer allows</description>
          <addressOffset>0x19C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_TIMERWRAPS</name>
              <description>Event triggering when the timer wraps around. This is useful if one wants to count longer than the HW timer allows</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_STROBETIMETRACKUPDATED</name>
          <description>New information from the symbol time tracker. See STROBETIMESTATUS</description>
          <addressOffset>0x1A0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_STROBETIMETRACKUPDATED</name>
              <description>New information from the symbol time tracker. See STROBETIMESTATUS</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_DEMODCTRLCONDTRIGGERED0</name>
          <description>Condition 0 triggered and actions done</description>
          <addressOffset>0x1A4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_DEMODCTRLCONDTRIGGERED0</name>
              <description>Condition 0 triggered and actions done</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_DEMODCTRLCONDTRIGGERED1</name>
          <description>Condition 1 triggered and actions done</description>
          <addressOffset>0x1A8</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_DEMODCTRLCONDTRIGGERED1</name>
              <description>Condition 1 triggered and actions done</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_DEMODCTRLCONDTRIGGERED2</name>
          <description>Condition 2 triggered and actions done</description>
          <addressOffset>0x1AC</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_DEMODCTRLCONDTRIGGERED2</name>
              <description>Condition 2 triggered and actions done</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_RESERVED_44</name>
          <description>UNUSED_44</description>
          <addressOffset>0x1B0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_RESERVED_44</name>
              <description>UNUSED_44</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_RESERVED_45</name>
          <description>UNUSED_45</description>
          <addressOffset>0x1B4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_RESERVED_45</name>
              <description>UNUSED_45</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_RESERVED_46</name>
          <description>UNUSED_46</description>
          <addressOffset>0x1B8</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_RESERVED_46</name>
              <description>UNUSED_46</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_RESERVED_47</name>
          <description>UNUSED_47</description>
          <addressOffset>0x1BC</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_RESERVED_47</name>
              <description>UNUSED_47</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_ACQINJ0DMAEND</name>
          <description>ACQ DMA end</description>
          <addressOffset>0x1C0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_ACQINJ0DMAEND</name>
              <description>ACQ DMA end</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_ACQINJ1DMAEND</name>
          <description>INJ DMA end</description>
          <addressOffset>0x1C4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_ACQINJ1DMAEND</name>
              <description>INJ DMA end</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
