adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>INTENSET11</name>
          <description>Enable interrupt</description>
          <addressOffset>0x32C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <modifiedWriteValues>oneToSet</modifiedWriteValues>
          <fields>
            <field>
              <name>INTENSET11</name>
              <lsb>0</lsb>
              <msb>17</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR10</name>
          <description>Disable interrupt</description>
          <addressOffset>0x330</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>INTENCLR10</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR11</name>
          <description>Disable interrupt</description>
          <addressOffset>0x334</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>INTENCLR11</name>
              <lsb>0</lsb>
              <msb>17</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>INTPEND10</name>
          <description>Pending interrupts</description>
          <addressOffset>0x338</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTPEND10</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>INTPEND11</name>
          <description>Pending interrupts</description>
          <addressOffset>0x33C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTPEND11</name>
              <lsb>0</lsb>
              <msb>17</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>Data rate and modulation</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MODE</name>
              <description>Radio data rate and modulation setting. The radio supports frequency-shift keying (FSK) modulation.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Nrf_1Mbit</name>
                  <description>1 Mbps Nordic proprietary radio mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Nrf_2Mbit</name>
                  <description>2 Mbps Nordic proprietary radio mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Nrf_250Kbit</name>
                  <description>Deprecated enumerator -  250 kbps Nordic proprietary radio mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ble_1Mbit</name>
                  <description>1 Mbps BLE</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ble_2Mbit</name>
                  <description>2 Mbps BLE</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ble_LR125Kbit</name>
                  <description>Long range 125 kbps TX, 125 kbps and 500 kbps RX</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ble_LR500Kbit</name>
                  <description>Long range 500 kbps TX, 125 kbps and 500 kbps RX</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Nrf_4Mbit0_5</name>
                  <description>4 Mbps Nordic proprietary radio mode (BT=0.5/h=0.5)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Nrf_4Mbit0_25</name>
                  <description>4 Mbps Nordic proprietary radio mode (BT=0.5/h=0.25)</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ieee802154_250Kbit</name>
                  <description>IEEE 802.15.4-2006 250 kbps</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MODEINTERNAL</name>
          <description>Internal mode setting, active only when MODEPROGENABLE==1</description>
          <addressOffset>0x404</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MODEINTERNAL</name>
              <description>Radio data rate and modulation setting. Same definition as MODE.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MODEPROGENABLE</name>
          <description>Switch that enables programmable modes</description>
          <addressOffset>0x408</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MODEPROGENABLE</name>
              <description>Enable manual triggering of MODEREADY event and activate MODEINTERNAL register (ie. MODEINTERNAL overrides MODE register)</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE_DEPENDENT_XPB_TEST_REGISTER</name>
          <description>Mode dependent XPB test register</description>
          <addressOffset>0x40C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VAL</name>
              <description>32 bits, only for testing mode dependency</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MODECNF</name>
          <description>Radio mode configuration register</description>
          <addressOffset>0x410</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000011</resetValue>
          <fields>
            <field>
              <name>DEMODN</name>
              <description>Demodulator mode override value</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Hyper</name>
                  <description>Hyper demodulator mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Standard</name>
                  <description>Standard demodulator mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZEROIF</name>
              <description>Zero-IF mode</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Default mode (heterodyne)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZeroIF</name>
                  <description>Zero-IF mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSEL</name>
              <description>Sideband select</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Low-side LO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>High-side LO</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTX</name>
              <description>Default TX value. Specifies what the RADIO will transmit when it is not started, i.e.
          between:
          RADIO.EVENTS_READY and RADIO.TASKS_START
          RADIO.EVENTS_END and RADIO.TASKS_START
          RADIO.EVENTS_END and RADIO.EVENTS_DISABLED)</description>
              <lsb>3</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B1</name>
                  <description>Transmit '1'</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B0</name>
                  <description>Transmit '0'</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Center</name>
                  <description>Transmit center frequency
          When tuning the crystal for centre frequency, the RADIO must
          be set in DTX = Center mode to be able to achieve the expected
          accuracy. This is only a valid setting for Nrf_1Mbit, Nrf_2Mbit,
          Nrf_250kbit, Ble_1Mbit and Ble_2Mbit.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IQMODLOOPBACK</name>
              <description>Loopback from IQ modulator (TODO: is it a good place?)</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Digital loopback off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Digital loopback on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IQRAMSEL</name>
              <description>IQ RAM select</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>off</name>
                  <description>IQ RAM select off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>on</name>
                  <description>IQ RAM select on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC</name>
          <description>Misc configuration collection (to be renamed when more bits are defined)</description>
          <addressOffset>0x414</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>DISABLEADDRWINDOW</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGCFREEZEAFTERREF</name>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EntireCTE</name>
                  <description>Gain freeze will apply to whole CTE,</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AfterRefPeriod</name>
                  <description>Gain freeze will apply to only after reference period of CTE.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGCFREEZEGAINENABLE</name>
              <description>Override AGC gain setting during CTE (from QOVERRIDE10)</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Adjust</name>
                  <description>AGC gain settings will keep adjusting during CTE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Freeze</name>
                  <description>AGC gain settings will freeze (not keep adjusting) during CTE</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE</name>
          <description>Current radio state</description>
          <addressOffset>0x420</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STATE</name>
              <description>Current radio state</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>RADIO is in the Disabled state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxRu</name>
                  <description>RADIO is in the RXRU state</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxIdle</name>
                  <description>RADIO is in the RXIDLE state</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Rx</name>
                  <description>RADIO is in the RX state</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxDisable</name>
                  <description>RADIO is in the RXDISABLED state</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxRu</name>
                  <description>RADIO is in the TXRU state</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxIdle</name>
                  <description>RADIO is in the TXIDLE state</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tx</name>
                  <description>RADIO is in the TX state</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxDisable</name>
                  <description>RADIO is in the TXDISABLED state</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EDCTRL</name>
          <description>IEEE 802.15.4 energy detect control</description>
          <addressOffset>0x430</addressOffset>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>EDCNT</name>
              <description>IEEE 802.15.4 energy detect loop count</description>
              <lsb>0</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>EDPERIOD</name>
              <description>IEEE 802.15.4 energy detect/cca period, 4us resolution</description>
              <lsb>24</lsb>
              <msb>29</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EDSAMPLE</name>
          <description>IEEE 802.15.4 energy detect level</description>
          <addressOffset>0x434</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EDLVL</name>
              <description>IEEE 802.15.4 energy detect level</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CCACTRL</name>
          <description>IEEE 802.15.4 clear channel assessment control</description>
          <addressOffset>0x438</addressOffset>
          <access>read-write</access>
          <resetValue>0x052D0000</resetValue>
          <fields>
            <field>
              <name>CCAMODE</name>
              <description>CCA mode of operation</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EdMode</name>
                  <description>Energy above threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CarrierMode</name>
                  <description>Carrier seen</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CarrierAndEdMode</name>
                  <description>Energy above threshold AND carrier seen</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CarrierOrEdMode</name>
                  <description>Energy above threshold OR carrier seen</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EdModeTest1</name>
                  <description>Energy above threshold test mode that will abort when first ED measurement over threshold is seen. No averaging.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCAEDTHRES</name>
              <description>CCA energy busy threshold. Used in all the CCA modes except CarrierMode.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>CCACORRTHRES</name>
              <description>CCA correlator busy threshold. Only relevant to CarrierMode, CarrierAndEdMode, and CarrierOrEdMode.</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>CCACORRCNT</name>
              <description>Limit for occurances above CCACORRTHRES. When not equal to zero the corrolator based signal detect is enabled.</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAWHITEIV</name>
          <description>Data whitening initial value</description>
          <addressOffset>0x440</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>DATAWHITEIV</name>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
