adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>ACQINJCNF0</name>
          <description>Data acquisition capture mode</description>
          <addressOffset>0x448</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACQMODE</name>
              <description>Data acquisition capture mode</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCIQ</name>
                  <description>Logging ADCI and ADCQ</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCIQANDAGCGAIN</name>
                  <description>Logging ADCI, ADCQ and AGC gain settings</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGCGAINANDPKD</name>
                  <description>Logging AGC gain settings and peak detector outputs</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEIQ</name>
                  <description>Logging FrontEnd sampleI and sampleQ</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BBIQ</name>
                  <description>Logging BaseBand I and Q</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BBSTDOUT</name>
                  <description>Logging BaseBand std demodulator outputs (original ones, not the delayed version)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BBHYPOUT</name>
                  <description>Logging BaseBand hyp demodulator outputs</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BBSTDHYPMUXOUT</name>
                  <description>Logging muxed demodulator outputs and flags</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADPLLTRACE</name>
                  <description>ADPLL tracing</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INJMODE</name>
              <description>Data hijack mode (Do not select the same SRC for one than more DMAs. otherwise higher index takes over control.)</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FFSRC</name>
                  <description>Pick up IQ samples from RAM as FrontEnd input (hijack ADC output)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BBSRC</name>
                  <description>Pick up IQ samples from RAM as Radio BaseBand input</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXSRC</name>
                  <description>Pick up Tx bits from RAM (skipping packet assembler as modulator input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADPLLMODSRC</name>
                  <description>Pick up arbitrary wave from RAM to ADPLL</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIR</name>
              <description>Data acquisition or injection</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACQ</name>
                  <description>Peripheral to memory</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INJ</name>
                  <description>Memory to peripheral</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQINJCNF1</name>
          <description>Data acquisition capture mode</description>
          <addressOffset>0x44C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACQMODE</name>
              <description>Data acquisition capture mode</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCIQ</name>
                  <description>Logging ADCI and ADCQ</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCIQANDAGCGAIN</name>
                  <description>Logging ADCI, ADCQ and AGC gain settings</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGCGAINANDPKD</name>
                  <description>Logging AGC gain settings and peak detector outputs</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEIQ</name>
                  <description>Logging FrontEnd sampleI and sampleQ</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BBIQ</name>
                  <description>Logging BaseBand I and Q</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BBSTDOUT</name>
                  <description>Logging BaseBand std demodulator outputs (original ones, not the delayed version)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BBHYPOUT</name>
                  <description>Logging BaseBand hyp demodulator outputs</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BBSTDHYPMUXOUT</name>
                  <description>Logging muxed demodulator outputs and flags</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADPLLTRACE</name>
                  <description>ADPLL tracing</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INJMODE</name>
              <description>Data hijack mode (Do not select the same SRC for one than more DMAs. otherwise higher index takes over control.)</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FFSRC</name>
                  <description>Pick up IQ samples from RAM as FrontEnd input (hijack ADC output)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BBSRC</name>
                  <description>Pick up IQ samples from RAM as Radio BaseBand input</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXSRC</name>
                  <description>Pick up Tx bits from RAM (skipping packet assembler as modulator input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADPLLMODSRC</name>
                  <description>Pick up arbitrary wave from RAM to ADPLL</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIR</name>
              <description>Data acquisition or injection</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACQ</name>
                  <description>Peripheral to memory</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INJ</name>
                  <description>Memory to peripheral</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQINJDMA0_ENABLE</name>
          <description>Enable or disable data acquisition</description>
          <addressOffset>0x450</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACQINJDMA0_ENABLE</name>
              <description>Enable or disable data acquisition</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Data acquisition is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Data acquisition is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQINJDMA0_PTR</name>
          <description>ACQ DMA pointer</description>
          <addressOffset>0x454</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OFFSET</name>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>BASE</name>
              <lsb>29</lsb>
              <msb>29</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQINJDMA0_MAXCNT</name>
          <description>Maximum number of 32-bit words to transfer</description>
          <addressOffset>0x458</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACQINJDMA0_MAXCNT</name>
              <description>Maximum number of 32-bit words to transfer</description>
              <lsb>0</lsb>
              <msb>13</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQINJDMA0_AMOUNT</name>
          <description>Number of 32-bit words transferred in the last transaction</description>
          <addressOffset>0x45C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACQINJDMA0_AMOUNT</name>
              <description>Number of 32-bit words transferred in the last transaction</description>
              <lsb>0</lsb>
              <msb>13</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQINJDMA1_ENABLE</name>
          <description>Enable or disable data store</description>
          <addressOffset>0x460</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACQINJDMA1_ENABLE</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Data store is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Data store is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQINJDMA1_PTR</name>
          <description>ACQ DMA pointer</description>
          <addressOffset>0x464</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OFFSET</name>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>BASE</name>
              <lsb>29</lsb>
              <msb>29</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQINJDMA1_MAXCNT</name>
          <description>Maximum number of 32-bit words to transfer</description>
          <addressOffset>0x468</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MAXCNT</name>
              <lsb>0</lsb>
              <msb>13</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQINJDMA1_AMOUNT</name>
          <description>Number of 32-bit words transferred in the last transaction</description>
          <addressOffset>0x46C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AMOUNT</name>
              <lsb>0</lsb>
              <msb>13</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>DEBUGPSEL</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_DEBUGPSEL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x488</addressOffset>
          <register>
            <name>CLOCK</name>
            <description>Pin select for RADIO clock (direct mode, base band debug. txCk and ckDataIn signals)</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA</name>
            <description>Pin select for RADIO data (direct mode, base band debug. txRadioData and dataIn signals)</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>EXTPSEL</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_EXTPSEL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x490</addressOffset>
          <register>
            <name>LNACTRL</name>
            <description>Pin select for external LNA control</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PACTRL</name>
            <description>Pin select for external PA control</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>GAIN_OUT</name>
          <description>Gain readout (LNA_OUT_SPI for nrf52/53)</description>
          <addressOffset>0x4A0</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>LNA_GAIN</name>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>MIXFILTBYPASS</name>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>AAF_GAIN</name>
              <lsb>12</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
