adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>SHORTCUT_INTERNAL</name>
          <description>TODO</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RadioTxReadyRadioCalStart</name>
              <description>Internal shortcut</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>RadioRxReadyRadioCalStart</name>
              <description>Internal shortcut</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>RadioLbReadyRadioCalStart</name>
              <description>Internal shortcut</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>RadioRxReadyDmaStart</name>
              <description>Internal shortcut</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>RadioLbReadyDmaStart</name>
              <description>Internal shortcut</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>RadioDisabledRadioTxEn</name>
              <description>Internal shortcut</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>RadioDisabledRadioRxEn</name>
              <description>Internal shortcut</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>RadioDisabledRadioLbEn</name>
              <description>Internal shortcut</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>RadioDisabledRadioChNoIncr</name>
              <description>Internal shortcut</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>RadioChNoUpdatedRadioTxEn</name>
              <description>Internal shortcut</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>RadioChNoUpdatedRadioRxEn</name>
              <description>Internal shortcut</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>RadioChNoUpdatedRadioLbEn</name>
              <description>Internal shortcut</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>RadioCalDoneRadioDisable</name>
              <description>Internal shortcut</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>RadioCalDoneRadioPaTestStart</name>
              <description>Internal shortcut</description>
              <lsb>13</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>RadioCalDoneDmaStart</name>
              <description>Internal shortcut</description>
              <lsb>14</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>DmaEndRadioDisable</name>
              <description>Internal shortcut</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE_STAND_ALONE</name>
          <description>TODO</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RadioModeInt</name>
              <description>Internal radio mode consists of sSel, zeroIf, deModN and mode[3:0]</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TimingMode</name>
              <description>0: Default ramp-up time, compatible with 180nm radio. 1: Fast ramp-up.</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>UseRadioModeInt</name>
              <description>0: use radioMode/radioModeUpdate from port (controlled from top), 1: use radioMode/radioModeUpdate from registers in this IP</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQUENCY</name>
          <description>Frequency</description>
          <addressOffset>0x508</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>FREQUENCY</name>
              <description>Radio channel frequency. Frequency = 2400 + FREQUENCY (MHz).</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>MAP</name>
              <description>Channel map selection. 0: Channel map between 2400 MHZ .. 2500 MHz, Frequency = 2400 + FREQUENCY (MHz). 1: Channel map between 2400 MHZ .. 2500 MHz, Frequency = 2360 + FREQUENCY (MHz).</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQUENCY_CONFIG</name>
          <description>TODO</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000001</resetValue>
          <fields>
            <field>
              <name>FsChNoIncrStep</name>
              <description>Radio channel incremental step unit.</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>BufferedFsCh</name>
              <description>Set to high to buffer FREQUENCY register so that sub-modules in the MMI will only update next frequency config at TX_EN, RX_EN and LB_EN. Set to low if special test is needed for FS test.</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TXPOWER</name>
          <description>Output power</description>
          <addressOffset>0x510</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXPOWER</name>
              <description>RADIO output power</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Pos10dBm_2</name>
                  <description>+10 dBm</description>
                  <value>0x0B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos10dBm</name>
                  <description>+10 dBm</description>
                  <value>0x0A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos9dBm</name>
                  <description>+9 dBm</description>
                  <value>0x09</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos8dBm</name>
                  <description>+8 dBm</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos7dBm</name>
                  <description>+7 dBm</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos6dBm</name>
                  <description>+6 dBm</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos5dBm</name>
                  <description>+5 dBm</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos4dBm</name>
                  <description>+4 dBm</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos3dBm</name>
                  <description>+3 dBm</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos2dBm</name>
                  <description>+2 dBm</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos1dBm</name>
                  <description>+1 dBm</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0dBm</name>
                  <description>0 dBm</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg1dBm</name>
                  <description>-1 dBm</description>
                  <value>0xFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg2dBm</name>
                  <description>-2 dBm</description>
                  <value>0xFE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg4dBm</name>
                  <description>-4 dBm</description>
                  <value>0xFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg8dBm</name>
                  <description>-8 dBm</description>
                  <value>0xF8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg12dBm</name>
                  <description>-12 dBm</description>
                  <value>0xF4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg16dBm</name>
                  <description>-16 dBm</description>
                  <value>0xF0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg20dBm</name>
                  <description>-20 dBm</description>
                  <value>0xEC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg30dBm</name>
                  <description>-30 dBm</description>
                  <value>0xE2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg40dBm</name>
                  <description>-40 dBm</description>
                  <value>0xD8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg70dBm</name>
                  <description>-70 dBm</description>
                  <value>0xBA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIFS</name>
          <description>Interframe spacing in us</description>
          <addressOffset>0x514</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIFS</name>
              <description>Interframe spacing in us. Interframe space is the time interval between two consecutive packets. It is defined as the time, in microseconds, from the end of the last bit of the previous packet to the start of the first bit of the subsequent packet.</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SPHYNXSUPPORTEVENTS</name>
          <description>TODO</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TTxDisable</name>
              <description>Transition time from RXDISABLE state to DISABLED state. (unit: 1us)</description>
              <lsb>12</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>TRxDisable</name>
              <description>Transition time from TXDISABLE state to DISABLED state. (unit: 1us)</description>
              <lsb>17</lsb>
              <msb>21</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CALIBRATION_TARGET</name>
          <description>TODO</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CalTarget</name>
              <description>Calibration target selection for calibration engine. 0: DC_CAL, 1: RC_CAL</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CALIBRATION_CONFIG</name>
          <description>TODO</description>
          <addressOffset>0x524</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CalTstart</name>
              <description>Startup wait time</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>CalTsettle</name>
              <description>Settle wait time</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>CalTcompare</name>
              <description>Compare wait time</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>CalBits</name>
              <description>Number of valid bits to be calibrated</description>
              <lsb>24</lsb>
              <msb>26</msb>
            </field>
            <field>
              <name>CalInvertCmp1</name>
              <description>1: invert calCmp1 before it goes into calibration engine #1</description>
              <lsb>28</lsb>
              <msb>28</msb>
            </field>
            <field>
              <name>CalInvertCmp2</name>
              <description>1: invert calCmp2 before it goes into calibration engine #2</description>
              <lsb>29</lsb>
              <msb>29</msb>
            </field>
            <field>
              <name>CalManual</name>
              <description>0: use hard-coded calibration timing, 1: use manual calibration timing above</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CALIBRATION_RESULT</name>
          <description>TODO</description>
          <addressOffset>0x528</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RcCalCode</name>
              <description>Calibration result from RC calibration</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>RfMixDcCalI</name>
              <description>Calibration result from DC offset calibration on channel I</description>
              <lsb>4</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>RfMixDcCalQ</name>
              <description>Calibration result from DC offset calibration on channel Q</description>
              <lsb>11</lsb>
              <msb>17</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SPHYNXANA_TEST</name>
          <description>TODO</description>
          <addressOffset>0x530</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SphynxAteBiasfs</name>
              <description>Analog test enable for BIAS_FS</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>SphynxAteFs</name>
              <description>Analog test enable for FS</description>
              <lsb>4</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>SphynxAteRxmix</name>
              <description>Analog test enable for RX MIX</description>
              <lsb>11</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>SphynxAteRxAaf</name>
              <description>Analog test enable for RX AAF</description>
              <lsb>13</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>SphynxAteRxTx</name>
              <description>Analog test enable for RX TX</description>
              <lsb>19</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>SphynxAteTxPwrctrl</name>
              <description>Analog test enable for TX PWRCTRL</description>
              <lsb>24</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>SphynxDteFs</name>
              <description>Digital test enable for digital logic in analog macro</description>
              <lsb>26</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SPHYNXANA_FS_CTRL_0</name>
          <description>TODO</description>
          <addressOffset>0x534</addressOffset>
          <access>read-write</access>
          <resetValue>0x20C59000</resetValue>
          <fields>
            <field>
              <name>SphynxFsldoBypass</name>
              <description>Bypass FS LDOs</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>SphynxFsvcoCtrl</name>
              <description>Spare, not used</description>
              <lsb>6</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>SphynxFsvcoSwRef</name>
              <description>FS swing calibration</description>
              <lsb>10</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>SphynxFsDiv2Cm</name>
              <description>Set common mode for DIV2</description>
              <lsb>15</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>SphynxFsDiv2Ctrl</name>
              <description>Spare, not used</description>
              <lsb>19</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>SphynxFsDiv2Osc</name>
              <description>Change back bias of NMOS in ROSC inside DIV2</description>
              <lsb>22</lsb>
              <msb>26</msb>
            </field>
            <field>
              <name>SphynxFsDtcCtrl</name>
              <description>0: controls bleed current from supply, 1: bypasses DTC to send XO out directly</description>
              <lsb>27</lsb>
              <msb>28</msb>
            </field>
            <field>
              <name>SphynxFsDtcEdgeAlign</name>
              <description>Resync at flip flop inside DTC</description>
              <lsb>29</lsb>
              <msb>29</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SPHYNXANA_FS_CTRL_1</name>
          <description>TODO</description>
          <addressOffset>0x538</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SphynxFsRefIpptrim</name>
              <description>For current calibration</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>SphynxFsRefVttrim</name>
              <description>For voltage tuning of reference</description>
              <lsb>5</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>SphynxFsScanbusIn</name>
              <description>DFT control/scan-in to AdPll. [4]: arstScan, [3]: scanTest, [2]: scanCk, [1]: scanEn, [0]: scanIn</description>
              <lsb>9</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>SphynxFsTdcCtrl</name>
              <description>Spare, not used</description>
              <lsb>18</lsb>
              <msb>20</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SPHYNXANA_FS_CTRL_2</name>
          <description>TODO</description>
          <addressOffset>0x53C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SphynxSwatTrim</name>
              <description>SWAT_TRIM_0V8[2:0] for SWAT_VREF trimming (default is 3b'000) and SWAT_TRIM_0V8[4:3] (default is 2b'00) for IBPSR trimming</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SPHYNXANA_RX_CTRL</name>
          <description>TODO</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
          <resetValue>0x00040000</resetValue>
          <fields>
            <field>
              <name>SphynxBypassLdoRx</name>
              <description>Bypass Rx LDOs.</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>SphynxRxmixQleadsi</name>
              <description>1: output from MIX_AMP is Q leading I, 0 output from MIX_AMP is I leading Q.</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>SphynxRxAafRctrimm</name>
              <description>RC trim values for RX_AAF generated by RC_CAL</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>SphynxRxAafVcmTrim</name>
              <description>TODO</description>
              <lsb>8</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>SphynxLnaCfreq</name>
              <description>TODO</description>
              <lsb>11</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>SphynxLnaCurr</name>
              <description>TODO</description>
              <lsb>15</lsb>
              <msb>17</msb>
            </field>
            <field>
              <name>SphynxAdcVbulkTrim</name>
              <description>TODO</description>
              <lsb>18</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>SphynxAdcOffsetCalc</name>
              <description>TODO</description>
              <lsb>19</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>SphynxAdcTimingCalc</name>
              <description>TODO</description>
              <lsb>20</lsb>
              <msb>20</msb>
            </field>
          </fields>
        </register>
