adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>SPHYNXANA_TX_CTRL</name>
          <description>TODO</description>
          <addressOffset>0x544</addressOffset>
          <access>read-write</access>
          <resetValue>0x00001000</resetValue>
          <fields>
            <field>
              <name>SphynxBypassLdoTx</name>
              <description>Bypass Tx LDOs.</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>SphynxTxPaSramp</name>
              <description>TX PA ramp up/down control.</description>
              <lsb>3</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>SphynxTxPwrctrlTune</name>
              <description>TODO</description>
              <lsb>6</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>SphynxTxPwrFine</name>
              <description>Radio Tx output power fine tune.</description>
              <lsb>12</lsb>
              <msb>14</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SPHYNXANA_MODE_DEPENDENT</name>
          <description>TODO</description>
          <addressOffset>0x548</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SphynxRxAafFreq</name>
              <description>Select Rx IF frequency. 0: 1Mbps, 1: 2Mbps(4Mbps)</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SPHYNXANA_RX_TRIM_CODE</name>
          <description>TODO</description>
          <addressOffset>0x54C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OvrValRcCalCode</name>
              <description>Override values on RCCAL_CODE_0V8</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>OvrEnRcCalCode</name>
              <description>For RCCAL_CODE_0V8, 0: controlled by CalibrationEngine, 1: overridden by register</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>OvrValRfMixDcCalI</name>
              <description>Override values on RXMIX_DCCAL_I_0V8</description>
              <lsb>8</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>OvrEnRfMixDcCalI</name>
              <description>For RXMIX_DCCAL_I_0V8, 0: controlled by CalibrationEngine, 1: overridden by register</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>OvrValRfMixDcCalQ</name>
              <description>Override values on RXMIX_DCCAL_Q_0V8</description>
              <lsb>16</lsb>
              <msb>22</msb>
            </field>
            <field>
              <name>OvrEnRfMixDcCalQ</name>
              <description>For RXMIX_DCCAL_Q_0V8, 0: controlled by CalibrationEngine, 1: overridden by register</description>
              <lsb>23</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SPHYNXANA_STATUS</name>
          <description>TODO</description>
          <addressOffset>0x550</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SphynxAdcBiAo</name>
              <description>Raw ADC I channel output from RX_SAR2</description>
              <lsb>0</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>SphynxAdcBqAo</name>
              <description>Raw ADC Q channel output from RX_SAR2</description>
              <lsb>11</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>SphynxCalCmpRccalAo</name>
              <description>Raw comparator output of RC calibration from RC_CAL</description>
              <lsb>22</lsb>
              <msb>22</msb>
            </field>
            <field>
              <name>SphynxAafDccalIAo</name>
              <description>Raw comparator output of DC calibration from RX_AAF I channel</description>
              <lsb>23</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>SphynxAafDccalQAo</name>
              <description>Raw comparator output of DC calibration from RX_AAF Q channel</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>SphynxRxPkdetAo</name>
              <description>Raw peak detector output from RX_PKDET</description>
              <lsb>25</lsb>
              <msb>26</msb>
            </field>
            <field>
              <name>SphynxFsScanOutAo</name>
              <description>DFT Scan-out from AdPll</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_GROUP_ALL_0</name>
          <description>TODO</description>
          <addressOffset>0x570</addressOffset>
          <access>read-write</access>
          <resetValue>0x010000A0</resetValue>
          <fields>
            <field>
              <name>TPllSettled</name>
              <description>(unit: 0.25us) Timing control of pllSettled</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TRetainRadio</name>
              <description>(unit: 0.25us) Timing control of retainRadio</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TPwrupRadio_Bit0</name>
              <description>(unit: 0.25us) Timing control of pwrupRadio[0]</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TPwrupRadio_Bit1</name>
              <description>(unit: 0.25us) Timing control of pwrupRadio[1]</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_GROUP_ALL_1</name>
          <description>TODO</description>
          <addressOffset>0x574</addressOffset>
          <access>read-write</access>
          <resetValue>0x00150300</resetValue>
          <fields>
            <field>
              <name>TPwrupFsRef_Bit0</name>
              <description>(unit: 0.25us) Timing control of PwrupFsRef[0]</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TPwrupFsRef_Bit1</name>
              <description>(unit: 0.25us) Timing control of PwrupFsRef[1]</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TPwrupFsRef_Bit2</name>
              <description>(unit: 0.25us) Timing control of PwrupFsRef[2]</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_GROUP_ALL_2</name>
          <description>TODO</description>
          <addressOffset>0x578</addressOffset>
          <access>read-write</access>
          <resetValue>0x38182120</resetValue>
          <fields>
            <field>
              <name>TRstFsLs_Bit0</name>
              <description>(unit: 0.25us) Timing control of RstFsLs[0]</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TRstFsLs_Bit1</name>
              <description>(unit: 0.25us) Timing control of RstFsLs[1]</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TPwrupFsLdoVco_Bit0</name>
              <description>(unit: 0.25us) Timing control of PwrupFsLdoVco[0]</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TPwrupFsLdoVco_Bit1</name>
              <description>(unit: 0.25us) Timing control of PwrupFsLdoVco[1]</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_GROUP_ALL_3</name>
          <description>TODO</description>
          <addressOffset>0x57C</addressOffset>
          <access>read-write</access>
          <resetValue>0x30181C18</resetValue>
          <fields>
            <field>
              <name>TPwrupFsLdoDtc_Bit0</name>
              <description>(unit: 0.25us) Timing control of PwrupFsLdoDtc[0]</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TPwrupFsLdoDtc_Bit1</name>
              <description>(unit: 0.25us) Timing control of PwrupFsLdoDtc[1]</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TPwrupFsLdoDig_Bit0</name>
              <description>(unit: 0.25us) Timing control of PwrupFsLdoDig[0]</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TPwrupFsLdoDig_Bit1</name>
              <description>(unit: 0.25us) Timing control of PwrupFsLdoDig[1]</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_GROUP_ALL_4</name>
          <description>TODO</description>
          <addressOffset>0x580</addressOffset>
          <access>read-write</access>
          <resetValue>0x2420201C</resetValue>
          <fields>
            <field>
              <name>TPwrupFsLdoDiv_Bit0</name>
              <description>(unit: 0.25us) Timing control of PwrupFsLdoDiv[0]</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TPwrupFsLdoDiv_Bit1</name>
              <description>(unit: 0.25us) Timing control of PwrupFsLdoDiv[1]</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TPwrupFsLdoCnt_Bit0</name>
              <description>(unit: 0.25us) Timing control of PwrupFsLdoCnt[0]</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TPwrupFsLdoCnt_Bit1</name>
              <description>(unit: 0.25us) Timing control of PwrupFsLdoCnt[1]</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_GROUP_ALL_5</name>
          <description>TODO</description>
          <addressOffset>0x584</addressOffset>
          <access>read-write</access>
          <resetValue>0x30242420</resetValue>
          <fields>
            <field>
              <name>TPwrupFsLdoTdc_Bit0</name>
              <description>(unit: 0.25us) Timing control of PwrupFsLdoTdc[0]</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TPwrupFsLdoTdc_Bit1</name>
              <description>(unit: 0.25us) Timing control of PwrupFsLdoTdc[1]</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TArstFs</name>
              <description>(unit: 0.25us) Timing control of ArstFs</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TFsStart</name>
              <description>(unit: 0.25us) Timing control of FsStart</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_GROUP_ALL_6</name>
          <description>TODO</description>
          <addressOffset>0x588</addressOffset>
          <access>read-write</access>
          <resetValue>0x1E1A221A</resetValue>
          <fields>
            <field>
              <name>TPwrupFsDtc</name>
              <description>(unit: 0.25us) Timing control of PwrupFsDtc</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TPwrupFsTdc</name>
              <description>(unit: 0.25us) Timing control of PwrupFsTdc</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TPwrupFsVco</name>
              <description>(unit: 0.25us) Timing control of PwrupFsVco</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TPwrupFsDiv2</name>
              <description>(unit: 0.25us) Timing control of PwrupFsDiv2</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_GROUP_ALL_7</name>
          <description>TODO</description>
          <addressOffset>0x58C</addressOffset>
          <access>read-write</access>
          <resetValue>0x21030120</resetValue>
          <fields>
            <field>
              <name>TPwrupFsDiv2g4Counter</name>
              <description>(unit: 0.25us) Timing control of PwrupFsDiv2g4Counter</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TPwrupRxTxRef_Bit0</name>
              <description>(unit: 0.25us) Timing control of PwrupRxTxRef[0]</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TPwrupRxTxRef_Bit1</name>
              <description>(unit: 0.25us) Timing control of PwrupRxTxRef[1]</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TPwrupRxTxRef_Bit2</name>
              <description>(unit: 0.25us) Timing control of PwrupRxTxRef[2]</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_GROUP_ALL_8</name>
          <description>TODO</description>
          <addressOffset>0x590</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000028</resetValue>
          <fields>
            <field>
              <name>TRstFsLs_Bit2</name>
              <description>(unit: 0.25us) Timing control of RstFsLs[2]</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_MODE_DEPENDENT</name>
          <description>TODO</description>
          <addressOffset>0x594</addressOffset>
          <access>read-write</access>
          <resetValue>0x18100010</resetValue>
          <fields>
            <field>
              <name>TIfsDelta</name>
              <description>(unit: 0.25us) Timing control of IfsDelta</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TIfsDeltaPlus</name>
              <description>(unit: 0.25us) Timing control of IfsDeltaPlus</description>
              <lsb>8</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>TDeltaPipe</name>
              <description>(unit: 0.25us) Timing control of DeltaPipe</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TDeltaPwrdnPa</name>
              <description>(unit: 0.25us) Timing control of DeltaPwrdnPa</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_GROUP_RX_0</name>
          <description>TODO</description>
          <addressOffset>0x598</addressOffset>
          <access>read-write</access>
          <resetValue>0x6C646D6C</resetValue>
          <fields>
            <field>
              <name>TRstRxLs_Bit0</name>
              <description>(unit: 0.25us) Timing control of RstRxLs[0]</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TRstRxLs_Bit1</name>
              <description>(unit: 0.25us) Timing control of RstRxLs[1]</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TPwrupRxLdo_Bit0</name>
              <description>(unit: 0.25us) Timing control of PwrupRxLdo[0]</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TPwrupRxLdo_Bit1</name>
              <description>(unit: 0.25us) Timing control of PwrupRxLdo[1]</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_GROUP_RX_1</name>
          <description>TODO</description>
          <addressOffset>0x59C</addressOffset>
          <access>read-write</access>
          <resetValue>0x6C646C64</resetValue>
          <fields>
            <field>
              <name>TPwrupRxLdo_Bit2</name>
              <description>(unit: 0.25us) Timing control of PwrupRxLdo[2]</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TPwrupRxLdo_Bit3</name>
              <description>(unit: 0.25us) Timing control of PwrupRxLdo[3]</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TPwrupRxLdo_Bit4</name>
              <description>(unit: 0.25us) Timing control of PwrupRxLdo[4]</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TPwrupRxLdo_Bit5</name>
              <description>(unit: 0.25us) Timing control of PwrupRxLdo[5]</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_GROUP_RX_2</name>
          <description>TODO</description>
          <addressOffset>0x5A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x68686868</resetValue>
          <fields>
            <field>
              <name>TPwrupRxLna</name>
              <description>(unit: 0.25us) Timing control of PwrupRxLna</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TPwrupRxMix</name>
              <description>(unit: 0.25us) Timing control of PwrupRxMix</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TPwrupRx</name>
              <description>(unit: 0.25us) Timing control of PwrupRx</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TPwrupRxAaf</name>
              <description>(unit: 0.25us) Timing control of PwrupRxAaf</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_GROUP_RX_3</name>
          <description>TODO</description>
          <addressOffset>0x5A4</addressOffset>
          <access>read-write</access>
          <resetValue>0x68786868</resetValue>
          <fields>
            <field>
              <name>TPwrupRxSar_Bit0</name>
              <description>(unit: 0.25us) Timing control of PwrupRxSar[0]</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TPwrupRxSar_Bit1</name>
              <description>(unit: 0.25us) Timing control of PwrupRxSar[1]</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TPwrupRxPkd</name>
              <description>Spare register. Power up peak detector is now tied with power up mixer.</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TPwrupExtLna</name>
              <description>(unit: 0.25us) Timing control of PwrupExtLna</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_GROUP_RX_4</name>
          <description>TODO</description>
          <addressOffset>0x5A8</addressOffset>
          <access>read-write</access>
          <resetValue>0x78787468</resetValue>
          <fields>
            <field>
              <name>TArstAdc</name>
              <description>(unit: 0.25us) Timing control of ArstAdc</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TArstAdcEnd</name>
              <description>(unit: 0.25us) Timing control of ArstAdcEnd</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TRxAgcEn</name>
              <description>(unit: 0.25us) Timing control of RxAgcEn</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TRxDigEn</name>
              <description>(unit: 0.25us) Timing control of RxDigEn</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_GROUP_TX_0</name>
          <description>TODO</description>
          <addressOffset>0x5AC</addressOffset>
          <access>read-write</access>
          <resetValue>0x806C7C74</resetValue>
          <fields>
            <field>
              <name>TPwrupTxLdo_Bit0</name>
              <description>(unit: 0.25us) Timing control of PwrupTxLdo[0]</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TPwrupTxLdo_Bit1</name>
              <description>(unit: 0.25us) Timing control of PwrupTxLdo[1]</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TPwrupTxLdo_Bit2</name>
              <description>(unit: 0.25us) Timing control of PwrupTxLdo[2]</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TPwrupTxLdo_Bit3</name>
              <description>(unit: 0.25us) Timing control of PwrupTxLdo[3]</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
