adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>TIMINGENGINE_GROUP_TX_1</name>
          <description>TODO</description>
          <addressOffset>0x5B0</addressOffset>
          <access>read-write</access>
          <resetValue>0x7870806C</resetValue>
          <fields>
            <field>
              <name>TPwrupTxLdo_Bit4</name>
              <description>(unit: 0.25us) Timing control of PwrupTxLdo[4]</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TPwrupTxLdo_Bit5</name>
              <description>(unit: 0.25us) Timing control of PwrupTxLdo[5]</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TPwrupTx</name>
              <description>(unit: 0.25us) Timing control of PwrupTx</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TPwrupTxPwrCtrl</name>
              <description>(unit: 0.25us) Timing control of PwrupTxPwrCtrl</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_GROUP_TX_2</name>
          <description>TODO</description>
          <addressOffset>0x5B4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00007878</resetValue>
          <fields>
            <field>
              <name>TPwrupTxPa</name>
              <description>(unit: 0.25us) Timing control of PwrupTxPa</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TPwrupExtPa</name>
              <description>(unit: 0.25us) Timing control of PwrupExtPa</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_CONFIG</name>
          <description>TODO</description>
          <addressOffset>0x5B8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00020464</resetValue>
          <fields>
            <field>
              <name>TReduceTrxSwitch</name>
              <description>(unit: 0.25us) Reduced timing for on-the-fly switch on both Rx-&amp;gt;Tx and Tx-&amp;gt;Rx</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TrxTxTurnAroundHold</name>
              <description>(unit: 0.25us) Additional delay to hold Tx/Rx turnaround</description>
              <lsb>8</lsb>
              <msb>17</msb>
            </field>
            <field>
              <name>PwrupExtLnaBeforeRampUp</name>
              <description>In legacy timing mode, pwrupExtLna can be powered on before starting to ramp up by setting this registers to 1.</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>PwrupExtPaBeforeRampUp</name>
              <description>In legacy timing mode, pwrupExtPa can be powered on before starting to ramp up by setting this registers to 1.</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_OVR_EN_GROUP_ALL</name>
          <description>TODO</description>
          <addressOffset>0x5BC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OvrEnRetainRadio</name>
              <description>Override enable of RetainRadio</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>OvrEnPwrupRadio</name>
              <description>Override enable of PwrupRadio</description>
              <lsb>1</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>OvrEnPwrupFsRef</name>
              <description>Override enable of PwrupFsRef</description>
              <lsb>3</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>OvrEnRstFsLs</name>
              <description>Override enable of RstFsLs</description>
              <lsb>6</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>OvrEnPwrupFsLdoVco</name>
              <description>Override enable of PwrupFsLdoVco</description>
              <lsb>9</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>OvrEnPwrupFsLdoDtc</name>
              <description>Override enable of PwrupFsLdoDtc</description>
              <lsb>11</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>OvrEnPwrupFsLdoDig</name>
              <description>Override enable of PwrupFsLdoDig</description>
              <lsb>13</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>OvrEnPwrupFsLdoDiv</name>
              <description>Override enable of PwrupFsLdoDiv</description>
              <lsb>15</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>OvrEnPwrupFsLdoCnt</name>
              <description>Override enable of PwrupFsLdoCnt</description>
              <lsb>17</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>OvrEnPwrupFsLdoTdc</name>
              <description>Override enable of PwrupFsLdoTdc</description>
              <lsb>19</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>OvrEnPwrupFsDtc</name>
              <description>Override enable of PwrupFsDtc</description>
              <lsb>21</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>OvrEnPwrupFsTdc</name>
              <description>Override enable of PwrupFsTdc</description>
              <lsb>22</lsb>
              <msb>22</msb>
            </field>
            <field>
              <name>OvrEnPwrupFsVco</name>
              <description>Override enable of PwrupFsVco</description>
              <lsb>23</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>OvrEnPwrupFsDiv2</name>
              <description>Override enable of PwrupFsDiv2</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>OvrEnPwrupFsDiv2g4Counter</name>
              <description>Override enable of PwrupFsDiv2g4Counter</description>
              <lsb>25</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>OvrEnArstFs</name>
              <description>Override enable of ArstFs</description>
              <lsb>26</lsb>
              <msb>26</msb>
            </field>
            <field>
              <name>OvrEnFsStart</name>
              <description>Override enable of FsStart</description>
              <lsb>27</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>OvrEnPwrupRxTxRef</name>
              <description>Override enable of PwrupRxTxRef</description>
              <lsb>28</lsb>
              <msb>30</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_OVR_EN_GROUP_RXTX</name>
          <description>TODO</description>
          <addressOffset>0x5C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OvrEnRstRxLs</name>
              <description>Override enable of RstRxLs</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>OvrEnPwrupRxLdo</name>
              <description>Override enable of PwrupRxLdo</description>
              <lsb>2</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>OvrEnPwrupRxLna</name>
              <description>Override enable of PwrupRxLna</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>OvrEnPwrupRxMix</name>
              <description>Override enable of PwrupRxMix</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>OvrEnPwrupRx</name>
              <description>Override enable of PwrupRx</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>OvrEnPwrupRxAaf</name>
              <description>Override enable of PwrupRxAaf</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>OvrEnPwrupRxSar</name>
              <description>Override enable of PwrupRxSar</description>
              <lsb>12</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>OvrEnPwrupRxPkd</name>
              <description>Override enable of PwrupRxPkd</description>
              <lsb>14</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>OvrEnArstAdc</name>
              <description>Override enable of ArstAdc</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>OvrEnPwrupTxLdo</name>
              <description>Override enable of PwrupTxLdo</description>
              <lsb>16</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>OvrEnPwrupTx</name>
              <description>Override enable of PwrupTx</description>
              <lsb>22</lsb>
              <msb>22</msb>
            </field>
            <field>
              <name>OvrEnPwrupTxPwrCtrl</name>
              <description>Override enable of PwrupTxPwrCtrl</description>
              <lsb>23</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>OvrEnPwrupTxPa</name>
              <description>Override enable of PwrupTxPa</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>OvrEnPwrupExtLna</name>
              <description>Override enable of PwrupExtLna</description>
              <lsb>25</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>OvrEnPwrupExtPa</name>
              <description>Override enable of PwrupExtPa</description>
              <lsb>26</lsb>
              <msb>26</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_OVR_VAL_GROUP_ALL</name>
          <description>TODO</description>
          <addressOffset>0x5C4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OvrValRetainRadio</name>
              <description>Override value of RetainRadio</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>OvrValPwrupRadio</name>
              <description>Override value of PwrupRadio</description>
              <lsb>1</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>OvrValPwrupFsRef</name>
              <description>Override value of PwrupFsRef</description>
              <lsb>3</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>OvrValRstFsLs</name>
              <description>Override value of RstFsLs</description>
              <lsb>6</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>OvrValPwrupFsLdoVco</name>
              <description>Override value of PwrupFsLdoVco</description>
              <lsb>9</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>OvrValPwrupFsLdoDtc</name>
              <description>Override value of PwrupFsLdoDtc</description>
              <lsb>11</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>OvrValPwrupFsLdoDig</name>
              <description>Override value of PwrupFsLdoDig</description>
              <lsb>13</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>OvrValPwrupFsLdoDiv</name>
              <description>Override value of PwrupFsLdoDiv</description>
              <lsb>15</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>OvrValPwrupFsLdoCnt</name>
              <description>Override value of PwrupFsLdoCnt</description>
              <lsb>17</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>OvrValPwrupFsLdoTdc</name>
              <description>Override value of PwrupFsLdoTdc</description>
              <lsb>19</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>OvrValPwrupFsDtc</name>
              <description>Override value of PwrupFsDtc</description>
              <lsb>21</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>OvrValPwrupFsTdc</name>
              <description>Override value of PwrupFsTdc</description>
              <lsb>22</lsb>
              <msb>22</msb>
            </field>
            <field>
              <name>OvrValPwrupFsVco</name>
              <description>Override value of PwrupFsVco</description>
              <lsb>23</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>OvrValPwrupFsDiv2</name>
              <description>Override value of PwrupFsDiv2</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>OvrValPwrupFsDiv2g4Counter</name>
              <description>Override value of PwrupFsDiv2g4Counter</description>
              <lsb>25</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>OvrValArstFs</name>
              <description>Override value of ArstFs</description>
              <lsb>26</lsb>
              <msb>26</msb>
            </field>
            <field>
              <name>OvrValFsStart</name>
              <description>Override value of FsStart</description>
              <lsb>27</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>OvrValPwrupRxTxRef</name>
              <description>Override value of PwrupRxTxRef</description>
              <lsb>28</lsb>
              <msb>30</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_OVR_VAL_GROUP_RXTX</name>
          <description>TODO</description>
          <addressOffset>0x5C8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OvrValRstRxLs</name>
              <description>Override value of RstRxLs</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>OvrValPwrupRxLdo</name>
              <description>Override value of PwrupRxLdo</description>
              <lsb>2</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>OvrValPwrupRxLna</name>
              <description>Override value of PwrupRxLna</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>OvrValPwrupRxMix</name>
              <description>Override value of PwrupRxMix</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>OvrValPwrupRx</name>
              <description>Override value of PwrupRx</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>OvrValPwrupRxAaf</name>
              <description>Override value of PwrupRxAaf</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>OvrValPwrupRxSar</name>
              <description>Override value of PwrupRxSar</description>
              <lsb>12</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>OvrValPwrupRxPkd</name>
              <description>Override value of PwrupRxPkd</description>
              <lsb>14</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>OvrValArstAdc</name>
              <description>Override value of ArstAdc</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>OvrValPwrupTxLdo</name>
              <description>Override value of PwrupTxLdo</description>
              <lsb>16</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>OvrValPwrupTx</name>
              <description>Override value of PwrupTx</description>
              <lsb>22</lsb>
              <msb>22</msb>
            </field>
            <field>
              <name>OvrValPwrupTxPwrCtrl</name>
              <description>Override value of PwrupTxPwrCtrl</description>
              <lsb>23</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>OvrValPwrupTxPa</name>
              <description>Override value of PwrupTxPa</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>OvrValPwrupExtLna</name>
              <description>Override value of PwrupExtLna</description>
              <lsb>25</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>OvrValPwrupExtPa</name>
              <description>Override value of PwrupExtPa</description>
              <lsb>26</lsb>
              <msb>26</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGENGINE_MODE_DEPENDENT_2</name>
          <description>TODO</description>
          <addressOffset>0x5CC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000014</resetValue>
          <fields>
            <field>
              <name>TTxRxTurnAroundDelta</name>
              <description>Additional offset in Rx mode, for Rx to be able to be ready earlier, which is required for 2Mbps.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>TurnOffRadioWrtTxDataValid</name>
              <description>Turn off radio w.r.t txDataValid in addition to radioEn</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RXAGC_GAIN</name>
          <description>TODO</description>
          <addressOffset>0x5D0</addressOffset>
          <access>read-write</access>
          <resetValue>0x11091107</resetValue>
          <fields>
            <field>
              <name>AgcRFgainMax</name>
              <description>Maximum gain of RF gain</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>AgcRFgainMin</name>
              <description>Minimum gain of RF gain</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>AgcRFgainStepUp</name>
              <description>gain step for increasing RF gain</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>AgcRFgainStepDown</name>
              <description>gain step for decreasing RF gain</description>
              <lsb>12</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>AgcIFgainMax</name>
              <description>Maximum gain of IF gain</description>
              <lsb>16</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>AgcIFgainMin</name>
              <description>Minimum gain of IF gain</description>
              <lsb>20</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>AgcIFgainStepUp</name>
              <description>gain step for increasing IF gain</description>
              <lsb>24</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>AgcIFgainStepDown</name>
              <description>gain step for decreasing IF gain</description>
              <lsb>28</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
