adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>RXAGC_CONFIG</name>
          <description>TODO</description>
          <addressOffset>0x5D4</addressOffset>
          <access>read-write</access>
          <resetValue>0x001230C3</resetValue>
          <fields>
            <field>
              <name>AgcEnableGainSwitch</name>
              <description>Causes the RF gain to be decreased and the IF gain to be increased if the overall gain can be maintained</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>AgcRFpkDetResetCount</name>
              <description>The number of clock cycles after the adjustment of gain that the reset signal to the RF peak detector is set high</description>
              <lsb>1</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>AgcWait</name>
              <description>The number of clock cycles between each adjustment of the gain while addressMatch is low</description>
              <lsb>5</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>AgcWaitPacket</name>
              <description>The number of clock cycles between each adjustment of the gain while addressMatch is high</description>
              <lsb>11</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>AgcAafOverride</name>
              <description>Override value for aafGain</description>
              <lsb>17</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>AgcMixOverride</name>
              <description>Override value for mixGain</description>
              <lsb>21</lsb>
              <msb>22</msb>
            </field>
            <field>
              <name>AgcLnaOverride</name>
              <description>Override value for lnaGain</description>
              <lsb>23</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>AgcOverrideGain</name>
              <description>0: AGC takes control of all gains, 1: Control all gains (aafGain, mixGain, lnaGain) from registers</description>
              <lsb>26</lsb>
              <msb>26</msb>
            </field>
            <field>
              <name>AgcMixFiltBypass</name>
              <description>0: Enable RC-filter in passive mixer, 1: Bypass RC-filter in passive mixer</description>
              <lsb>27</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>AgcMixFiltBypassOvrEn</name>
              <description>0: AGC takes control of RC-filter in passive mixer, 1: Control RC-filter in passive mixer from register</description>
              <lsb>28</lsb>
              <msb>28</msb>
            </field>
            <field>
              <name>AgcToggle</name>
              <description>Enable(1) or disable(0) functional testmode for AGC</description>
              <lsb>29</lsb>
              <msb>30</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RXAGC_RSSI</name>
          <description>TODO</description>
          <addressOffset>0x5D8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RssiCal</name>
              <description>RSSI calibration value</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>Ed154Cal</name>
              <description>802.15.4 Energy Detect calibration value</description>
              <lsb>7</lsb>
              <msb>13</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RXAGC_STATUS</name>
          <description>TODO</description>
          <addressOffset>0x5DC</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000007F</resetValue>
          <fields>
            <field>
              <name>Rssi</name>
              <description>Received signal strength indicator</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>AafGain</name>
              <description>AAF gain status</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>MixGain</name>
              <description>MIX gain status</description>
              <lsb>12</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>LnaGain</name>
              <description>LNA gain status</description>
              <lsb>14</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>RfPkDet</name>
              <description>RF peak detector output after sync. Represent state[5:4] in RxAgc</description>
              <lsb>24</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>IfPkDet</name>
              <description>IF peak detector output. Represent state[3:2] in RxAgc</description>
              <lsb>26</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>BbPkDet</name>
              <description>BB peak detector output. Represent state[1:0] in RxAgc</description>
              <lsb>28</lsb>
              <msb>29</msb>
            </field>
            <field>
              <name>MixFiltBypass</name>
              <description>MIX RC-filter status</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RXSATURATIONDETECT</name>
          <description>TODO</description>
          <addressOffset>0x5E0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SatDelayCorrection</name>
              <description>combination of several PARs in PantherPar</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RXPEAKDETECTOR_IF</name>
          <description>TODO</description>
          <addressOffset>0x5E4</addressOffset>
          <access>read-write</access>
          <resetValue>0x04190384</resetValue>
          <fields>
            <field>
              <name>HighThres</name>
              <description>High threshold of IF peak detector. This valued is based on the 11-bits ADC of SPHYNX_ANA</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>LowThres</name>
              <description>Low threshold of IF peak detector. This valued is based on the 11-bits ADC of SPHYNX_ANA</description>
              <lsb>12</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>DecayStep</name>
              <description>TODO</description>
              <lsb>24</lsb>
              <msb>29</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BITCONVERTER</name>
          <description>TODO</description>
          <addressOffset>0x5E8</addressOffset>
          <access>read-write</access>
          <resetValue>0x003FF3FF</resetValue>
          <fields>
            <field>
              <name>FinalCalOffset_I</name>
              <description>ADC offset compensation of channel I. (signed)</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>FinalCalOffset_Q</name>
              <description>ADC offset compensation of channel Q. (signed)</description>
              <lsb>12</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAACQVIADMA</name>
          <description>TODO</description>
          <addressOffset>0x5F0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DataCaptureModeSelect</name>
              <description>Which of 4 existing mode it is running (each mode correspond the a particular set of data to be logged)</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>DmaAhbCtrlTag</name>
              <description>used to be NrfModem port - dmaAhbCtrlTag, selection of DMA in radio. MUX(Panther/UTxRxChain)</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUGRADIOPHY</name>
          <description>TODO</description>
          <addressOffset>0x5FC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>ReadRawGainStatus</name>
              <description>0: readout latched  gain values from RXAGC_STATUS, 1: readout raw gain values from RXAGC_STATUS</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>BufferedTxPwr</name>
              <description>Set to high to buffer TXPOWER so that sub-modules in the MMI will only update next tx power config at TX_EN, RX_EN and LB_EN. Set to low if special test is needed for Tx test.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>TieAdcBIToZero</name>
              <description>0: output normal adcBinaryBI, 1: tie adcBinaryBI to zero</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>TieAdcBQToZero</name>
              <description>0: output normal adcBinaryBQ, 1: tie adcBinaryBQ to zero</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>RfMixInvertSignBit</name>
              <description>1: Invert the sign bit of calibration code for DC offset calibration(invert DCCAL[4]). This inverts both channel I and Q.</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>ShortRcCalCodeToAafRcTrim</name>
              <description>1: short RCCAL_CODE[3:0] to RX_AAF_RCTRIMM[3:0]</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MODECONF</name>
          <description>IQCal status</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <resetValue>0x00010006</resetValue>
          <fields>
            <field>
              <name>SATDLY</name>
              <description>Mode dependent register with saturation delay for different modes</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>REMOVE_ME_WHEN_4M_IF_EXISTS</name>
              <description>temporary 4Mbps special case signal for mixer</description>
              <lsb>16</lsb>
              <msb>16</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FESTATUS</name>
          <description>Frontend readout register</description>
          <addressOffset>0x604</addressOffset>
          <access>read-only</access>
          <resetValue>0x00001010</resetValue>
          <fields>
            <field>
              <name>CALPHI</name>
              <description>calPhi from IQCal</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>CALAMP</name>
              <description>calAmp from IQCal</description>
              <lsb>8</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>CALFIN</name>
              <description>High when IQCal search finished</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>MAGNITUDE</name>
              <description>Magnitude output from BB peak detector</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FECONFIG</name>
          <description>Config for Mixer and Scaler</description>
          <addressOffset>0x608</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>QDISABLE</name>
              <description>Disable Q samples to save power</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>SCALERDECAY</name>
              <description>The number of clock cycles to wait before stepping down the internal memory for the scaling. The value 0 means that the decay feature is off.</description>
              <lsb>8</lsb>
              <msb>13</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IQCALCONF</name>
          <description>Gain and phase mismatch calibration control for I and Q</description>
          <addressOffset>0x60C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00101028</resetValue>
          <fields>
            <field>
              <name>IQCALWAIT</name>
              <description>Settling time (in number of 16 MHz clock periods) for rssi input to stabilize</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>CALAMP</name>
              <description>Stored calAmp value</description>
              <lsb>8</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>CALPHI</name>
              <description>Stored calPhi value</description>
              <lsb>16</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>CALPHISIGN</name>
              <description>Sign of calPhi value</description>
              <lsb>27</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>MODE</name>
              <description>IQCal search mode</description>
              <lsb>28</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Optimized</name>
                  <description>Optimized search algorithm.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Exhaustive</name>
                  <description>Exhaustive search.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Cancellation</name>
                  <description>Optimized search with cancellation.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUN</name>
              <description>Run I and Q calibration procedure</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Stored</name>
                  <description>Using stored values for calPhi and calAmp</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Calib</name>
                  <description>Running calibration.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LOGMAG</name>
          <description>IQCal status</description>
          <addressOffset>0x610</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000500</resetValue>
          <fields>
            <field>
              <name>ALPHA</name>
              <description>Alpha for IIR filter used in logMag calculation</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BBPKDETCONF</name>
          <description>Configuration for baseband peak detector</description>
          <addressOffset>0x614</addressOffset>
          <access>read-write</access>
          <resetValue>0x03014032</resetValue>
          <fields>
            <field>
              <name>HIGHTHRES</name>
              <description>High threshold for peak detector</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>LOWTHRESH</name>
              <description>Low threshold for peak detector</description>
              <lsb>12</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>DECAYSTEP</name>
              <description>Constant output reduction step</description>
              <lsb>24</lsb>
              <msb>29</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTMAIN_CKSEL_DECFIR</name>
          <description>Clock select register for the output outMain</description>
          <addressOffset>0x618</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>CKSEL</name>
              <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ClkSel_32M</name>
                  <description>CKSEL_32M</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_16M</name>
                  <description>CKSEL_16M</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_8M</name>
                  <description>CKSEL_8M</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_4M</name>
                  <description>CKSEL_4M</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_2M</name>
                  <description>CKSEL_2M</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_1M</name>
                  <description>CKSEL_1M</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_500K</name>
                  <description>CKSEL_500K</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_Bypass</name>
                  <description>CKSEL_BYPASS</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR0_CKSEL</name>
          <description>Clock select register for the PUnit decFIR0 of type IP_FIR</description>
          <addressOffset>0x61C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>CKSEL</name>
              <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ClkSel_32M</name>
                  <description>CKSEL_32M</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_16M</name>
                  <description>CKSEL_16M</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_8M</name>
                  <description>CKSEL_8M</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_4M</name>
                  <description>CKSEL_4M</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_2M</name>
                  <description>CKSEL_2M</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_1M</name>
                  <description>CKSEL_1M</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_500k</name>
                  <description>CKSEL_500K</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_Bypass</name>
                  <description>CKSEL_BYPASS</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR0_CONTROL</name>
          <description>Control register for the PUnit decFIR0 of type IP_FIR</description>
          <addressOffset>0x620</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>TAPSEL</name>
              <description>Tap-select: number of active taps minus 2</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR0_COEFFS_0</name>
          <description>Coefficient register 0 for the PUnit decFIR0 of type IP_FIR</description>
          <addressOffset>0x624</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>COEFFS_0</name>
              <description>Signed filter coefficient 0</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
