adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>DECFIR0_COEFFS_1</name>
          <description>Coefficient register 1 for the PUnit decFIR0 of type IP_FIR</description>
          <addressOffset>0x628</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>COEFFS_1</name>
              <description>Signed filter coefficient 1</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR0_COEFFS_2</name>
          <description>Coefficient register 2 for the PUnit decFIR0 of type IP_FIR</description>
          <addressOffset>0x62C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>COEFFS_2</name>
              <description>Signed filter coefficient 2</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR0_COEFFS_3</name>
          <description>Coefficient register 3 for the PUnit decFIR0 of type IP_FIR</description>
          <addressOffset>0x630</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COEFFS_3</name>
              <description>Signed filter coefficient 3</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR1_CKSEL</name>
          <description>Clock select register for the PUnit decFIR1 of type IP_FIR</description>
          <addressOffset>0x634</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CKSEL</name>
              <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ClkSel_32M</name>
                  <description>CKSEL_32M</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_16M</name>
                  <description>CKSEL_16M</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_8M</name>
                  <description>CKSEL_8M</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_4M</name>
                  <description>CKSEL_4M</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_2M</name>
                  <description>CKSEL_2M</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_1M</name>
                  <description>CKSEL_1M</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_500K</name>
                  <description>CKSEL_500K</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_Bypass</name>
                  <description>CKSEL_BYPASS</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR1_CONTROL</name>
          <description>Control register for the PUnit decFIR1 of type IP_FIR</description>
          <addressOffset>0x638</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>TAPSEL</name>
              <description>Tap-select: number of active taps minus 2</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR1_COEFFS_0</name>
          <description>Coefficient register 0 for the PUnit decFIR1 of type IP_FIR</description>
          <addressOffset>0x63C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>COEFFS_0</name>
              <description>Signed filter coefficient 0</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR1_COEFFS_1</name>
          <description>Coefficient register 1 for the PUnit decFIR1 of type IP_FIR</description>
          <addressOffset>0x640</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>COEFFS_1</name>
              <description>Signed filter coefficient 1</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR1_COEFFS_2</name>
          <description>Coefficient register 2 for the PUnit decFIR1 of type IP_FIR</description>
          <addressOffset>0x644</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000018</resetValue>
          <fields>
            <field>
              <name>COEFFS_2</name>
              <description>Signed filter coefficient 2</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR1_COEFFS_3</name>
          <description>Coefficient register 3 for the PUnit decFIR1 of type IP_FIR</description>
          <addressOffset>0x648</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>COEFFS_3</name>
              <description>Signed filter coefficient 3</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR1_COEFFS_4</name>
          <description>Coefficient register 4 for the PUnit decFIR1 of type IP_FIR</description>
          <addressOffset>0x64C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COEFFS_4</name>
              <description>Signed filter coefficient 4</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR1_COEFFS_5</name>
          <description>Coefficient register 5 for the PUnit decFIR1 of type IP_FIR</description>
          <addressOffset>0x650</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COEFFS_5</name>
              <description>Signed filter coefficient 5</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR2_CKSEL</name>
          <description>Clock select register for the PUnit decFIR2 of type IP_FIR</description>
          <addressOffset>0x654</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CKSEL</name>
              <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ClkSel_32M</name>
                  <description>CKSEL_32M</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_16M</name>
                  <description>CKSEL_16M</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_8M</name>
                  <description>CKSEL_8M</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_4M</name>
                  <description>CKSEL_4M</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_2M</name>
                  <description>CKSEL_2M</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_1M</name>
                  <description>CKSEL_1M</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_500K</name>
                  <description>CKSEL_500K</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_Bypass</name>
                  <description>CKSEL_BYPASS</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR2_CONTROL</name>
          <description>Control register for the PUnit decFIR2 of type IP_FIR</description>
          <addressOffset>0x658</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>TAPSEL</name>
              <description>Tap-select: number of active taps minus 2</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR2_COEFFS_0</name>
          <description>Coefficient register 0 for the PUnit decFIR2 of type IP_FIR</description>
          <addressOffset>0x65C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>COEFFS_0</name>
              <description>Signed filter coefficient 0</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR2_COEFFS_1</name>
          <description>Coefficient register 1 for the PUnit decFIR2 of type IP_FIR</description>
          <addressOffset>0x660</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>COEFFS_1</name>
              <description>Signed filter coefficient 1</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR2_COEFFS_2</name>
          <description>Coefficient register 2 for the PUnit decFIR2 of type IP_FIR</description>
          <addressOffset>0x664</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000018</resetValue>
          <fields>
            <field>
              <name>COEFFS_2</name>
              <description>Signed filter coefficient 2</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR2_COEFFS_3</name>
          <description>Coefficient register 3 for the PUnit decFIR2 of type IP_FIR</description>
          <addressOffset>0x668</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>COEFFS_3</name>
              <description>Signed filter coefficient 3</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR2_COEFFS_4</name>
          <description>Coefficient register 4 for the PUnit decFIR2 of type IP_FIR</description>
          <addressOffset>0x66C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COEFFS_4</name>
              <description>Signed filter coefficient 4</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR2_COEFFS_5</name>
          <description>Coefficient register 5 for the PUnit decFIR2 of type IP_FIR</description>
          <addressOffset>0x670</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COEFFS_5</name>
              <description>Signed filter coefficient 5</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTMAIN_CKSEL_IIR</name>
          <description>Clock select register for the output outMain</description>
          <addressOffset>0x674</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>CKSEL</name>
              <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ClkSel_32M</name>
                  <description>CKSEL_32M</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_16M</name>
                  <description>CKSEL_16M</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_8M</name>
                  <description>CKSEL_8M</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_4M</name>
                  <description>CKSEL_4M</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_2M</name>
                  <description>CKSEL_2M</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_1M</name>
                  <description>CKSEL_1M</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_500K</name>
                  <description>CKSEL_500K</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_Bypass</name>
                  <description>CKSEL_BYPASS</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTMAIN_SOURCE</name>
          <description>Source select register for the output outMain</description>
          <addressOffset>0x678</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>SOURCE</name>
              <description>Data source select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Src_IIR0</name>
                  <description>SRC_IIR0 (NOT LEGAL)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src_IIR1</name>
                  <description>SRC_IIR1 (NOT LEGAL)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src_NotChIIR0</name>
                  <description>SRC_NOTCHIIR0 (NOT LEGAL)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src_NotChIIR1</name>
                  <description>SRC_NOTCHIIR1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src_DecFIR</name>
                  <description>SRC_DECFIR</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src_InMain</name>
                  <description>SRC_INMAIN (NOT LEGAL)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTPEAKDET_CKSEL</name>
          <description>Clock select register for the output outPeakDet</description>
          <addressOffset>0x67C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>CKSEL</name>
              <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ClkSel_32M</name>
                  <description>CKSEL_32M</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_16M</name>
                  <description>CKSEL_16M</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_8M</name>
                  <description>CKSEL_8M</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_4M</name>
                  <description>CKSEL_4M</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_2M</name>
                  <description>CKSEL_2M</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_1M</name>
                  <description>CKSEL_1M</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_500K</name>
                  <description>CKSEL_500K</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_Bypass</name>
                  <description>CKSEL_BYPASS</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTPEAKDET_SOURCE</name>
          <description>Source select register for the output outPeakDet</description>
          <addressOffset>0x680</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>SOURCE</name>
              <description>Data source select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Src_IIR0</name>
                  <description>SRC_IIR0 (NOT LEGAL)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src_IIR1</name>
                  <description>SRC_IIR1 (NOT LEGAL)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src_NotChIIR0</name>
                  <description>SRC_NOTCHIIR0 (NOT LEGAL)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src_NotChIIR1</name>
                  <description>SRC_NOTCHIIR1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src_DecFIR</name>
                  <description>SRC_DECFIR</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src_InMain</name>
                  <description>SRC_INMAIN (NOT LEGAL)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
