adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>IIR0_CKSEL</name>
          <description>Clock select register for the PUnit IIR0 of type IP_IIR2</description>
          <addressOffset>0x684</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>CKSEL</name>
              <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ClkSel_32M</name>
                  <description>CKSEL_32M</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_16M</name>
                  <description>CKSEL_16M</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_8M</name>
                  <description>CKSEL_8M</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_4M</name>
                  <description>CKSEL_4M</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_2M</name>
                  <description>CKSEL_2M</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_1M</name>
                  <description>CKSEL_1M</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_500K</name>
                  <description>CKSEL_500K</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_Bypass</name>
                  <description>CKSEL_BYPASS</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IIR0_STATUS</name>
          <description>Status register for the PUnit IIR0 of type IP_IIR2</description>
          <addressOffset>0x688</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>SATURATION_IQ</name>
              <description>Saturation status for I/Q (bit 0/1) component (bitwise write 1 to clear)</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IIR0_COEFFS_B0</name>
          <description>Coefficient register B0 for the PUnit IIR0 of type IP_IIR2</description>
          <addressOffset>0x68C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <fields>
            <field>
              <name>COEFFS_B0</name>
              <description>Signed filter coefficient B0</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IIR0_COEFFS_B1</name>
          <description>Coefficient register B1 for the PUnit IIR0 of type IP_IIR2</description>
          <addressOffset>0x690</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <fields>
            <field>
              <name>COEFFS_B1</name>
              <description>Signed filter coefficient B1</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IIR0_COEFFS_B2</name>
          <description>Coefficient register B2 for the PUnit IIR0 of type IP_IIR2</description>
          <addressOffset>0x694</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COEFFS_B2</name>
              <description>Signed filter coefficient B2</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IIR0_COEFFS_A1</name>
          <description>Coefficient register A1 for the PUnit IIR0 of type IP_IIR2</description>
          <addressOffset>0x698</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000340</resetValue>
          <fields>
            <field>
              <name>COEFFS_A1</name>
              <description>Signed filter coefficient A1</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IIR0_COEFFS_A2</name>
          <description>Coefficient register A2 for the PUnit IIR0 of type IP_IIR2</description>
          <addressOffset>0x69C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COEFFS_A2</name>
              <description>Signed filter coefficient A2</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IIR1_CKSEL</name>
          <description>Clock select register for the PUnit IIR1 of type IP_IIR2</description>
          <addressOffset>0x6A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>CKSEL</name>
              <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ClkSel_32M</name>
                  <description>CKSEL_32M</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_16M</name>
                  <description>CKSEL_16M</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_8M</name>
                  <description>CKSEL_8M</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_4M</name>
                  <description>CKSEL_4M</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_2M</name>
                  <description>CKSEL_2M</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_1M</name>
                  <description>CKSEL_1M</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_500K</name>
                  <description>CKSEL_500K</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_Bypass</name>
                  <description>CKSEL_BYPASS</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IIR1_STATUS</name>
          <description>Status register for the PUnit IIR1 of type IP_IIR2</description>
          <addressOffset>0x6A4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>SATURATION_IQ</name>
              <description>Saturation status for I/Q (bit 0/1) component (bitwise write 1 to clear)</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IIR1_COEFFS_B0</name>
          <description>Coefficient register B0 for the PUnit IIR1 of type IP_IIR2</description>
          <addressOffset>0x6A8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>COEFFS_B0</name>
              <description>Signed filter coefficient B0</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IIR1_COEFFS_B1</name>
          <description>Coefficient register B1 for the PUnit IIR1 of type IP_IIR2</description>
          <addressOffset>0x6AC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>COEFFS_B1</name>
              <description>Signed filter coefficient B1</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IIR1_COEFFS_B2</name>
          <description>Coefficient register B2 for the PUnit IIR1 of type IP_IIR2</description>
          <addressOffset>0x6B0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>COEFFS_B2</name>
              <description>Signed filter coefficient B2</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IIR1_COEFFS_A1</name>
          <description>Coefficient register A1 for the PUnit IIR1 of type IP_IIR2</description>
          <addressOffset>0x6B4</addressOffset>
          <access>read-write</access>
          <resetValue>0x000001A0</resetValue>
          <fields>
            <field>
              <name>COEFFS_A1</name>
              <description>Signed filter coefficient A1</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IIR1_COEFFS_A2</name>
          <description>Coefficient register A2 for the PUnit IIR1 of type IP_IIR2</description>
          <addressOffset>0x6B8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000030</resetValue>
          <fields>
            <field>
              <name>COEFFS_A2</name>
              <description>Signed filter coefficient A2</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NOTCHIIR0_CKSEL</name>
          <description>Clock select register for the PUnit notchIIR0 of type IP_IIR2</description>
          <addressOffset>0x6BC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>CKSEL</name>
              <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ClkSel_32M</name>
                  <description>CKSEL_32M</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_16M</name>
                  <description>CKSEL_16M</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_8M</name>
                  <description>CKSEL_8M</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_4M</name>
                  <description>CKSEL_4M</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_2M</name>
                  <description>CKSEL_2M</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_1M</name>
                  <description>CKSEL_1M</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_500K</name>
                  <description>CKSEL_500K</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_Bypass</name>
                  <description>CKSEL_BYPASS</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NOTCHIIR0_SOURCE</name>
          <description>Source select register for the PUnit notchIIR0 of type IP_IIR2</description>
          <addressOffset>0x6C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SOURCE</name>
              <description>Data source select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Src_IIR0</name>
                  <description>SRC_IIR0 (NOT LEGAL)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src_IIR1</name>
                  <description>SRC_IIR1 (NOT LEGAL)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src_NotChIIR0</name>
                  <description>SRC_NOTCHIIR0 (NOT LEGAL)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src_NotChIIR1</name>
                  <description>SRC_NOTCHIIR1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src_DecFIR</name>
                  <description>SRC_DECFIR</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src_InMain</name>
                  <description>SRC_INMAIN (NOT LEGAL)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NOTCHIIR0_STATUS</name>
          <description>Status register for the PUnit notchIIR0 of type IP_IIR2</description>
          <addressOffset>0x6C4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>SATURATION_IQ</name>
              <description>Saturation status for I/Q (bit 0/1) component (bitwise write 1 to clear)</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NOTCHIIR0_COEFFS_B0</name>
          <description>Coefficient register B0 for the PUnit notchIIR0 of type IP_IIR2</description>
          <addressOffset>0x6C8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000078</resetValue>
          <fields>
            <field>
              <name>COEFFS_B0</name>
              <description>Signed filter coefficient B0</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NOTCHIIR0_COEFFS_B1</name>
          <description>Coefficient register B1 for the PUnit notchIIR0 of type IP_IIR2</description>
          <addressOffset>0x6CC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000156</resetValue>
          <fields>
            <field>
              <name>COEFFS_B1</name>
              <description>Signed filter coefficient B1</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NOTCHIIR0_COEFFS_B2</name>
          <description>Coefficient register B2 for the PUnit notchIIR0 of type IP_IIR2</description>
          <addressOffset>0x6D0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000078</resetValue>
          <fields>
            <field>
              <name>COEFFS_B2</name>
              <description>Signed filter coefficient B2</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NOTCHIIR0_COEFFS_A1</name>
          <description>Coefficient register A1 for the PUnit notchIIR0 of type IP_IIR2</description>
          <addressOffset>0x6D4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000156</resetValue>
          <fields>
            <field>
              <name>COEFFS_A1</name>
              <description>Signed filter coefficient A1</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NOTCHIIR0_COEFFS_A2</name>
          <description>Coefficient register A2 for the PUnit notchIIR0 of type IP_IIR2</description>
          <addressOffset>0x6D8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000070</resetValue>
          <fields>
            <field>
              <name>COEFFS_A2</name>
              <description>Signed filter coefficient A2</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NOTCHIIR1_CKSEL</name>
          <description>Clock select register for the PUnit notchIIR1 of type IP_IIR2</description>
          <addressOffset>0x6DC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>CKSEL</name>
              <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ClkSel_32M</name>
                  <description>CKSEL_32M</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_16M</name>
                  <description>CKSEL_16M</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_8M</name>
                  <description>CKSEL_8M</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_4M</name>
                  <description>CKSEL_4M</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_2M</name>
                  <description>CKSEL_2M</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_1M</name>
                  <description>CKSEL_1M</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_500K</name>
                  <description>CKSEL_500K</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_Bypass</name>
                  <description>CKSEL_BYPASS</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NOTCHIIR1_STATUS</name>
          <description>Status register for the PUnit notchIIR1 of type IP_IIR2</description>
          <addressOffset>0x6E0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>SATURATION_IQ</name>
              <description>Saturation status for I/Q (bit 0/1) component (bitwise write 1 to clear)</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NOTCHIIR1_COEFFS_B0</name>
          <description>Coefficient register B0 for the PUnit notchIIR1 of type IP_IIR2</description>
          <addressOffset>0x6E4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COEFFS_B0</name>
              <description>Signed filter coefficient B0</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NOTCHIIR1_COEFFS_B1</name>
          <description>Coefficient register B1 for the PUnit notchIIR1 of type IP_IIR2</description>
          <addressOffset>0x6E8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COEFFS_B1</name>
              <description>Signed filter coefficient B1</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NOTCHIIR1_COEFFS_B2</name>
          <description>Coefficient register B2 for the PUnit notchIIR1 of type IP_IIR2</description>
          <addressOffset>0x6EC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COEFFS_B2</name>
              <description>Signed filter coefficient B2</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
