adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>NOTCHIIR1_COEFFS_A1</name>
          <description>Coefficient register A1 for the PUnit notchIIR1 of type IP_IIR2</description>
          <addressOffset>0x6F0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COEFFS_A1</name>
              <description>Signed filter coefficient A1</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NOTCHIIR1_COEFFS_A2</name>
          <description>Coefficient register A2 for the PUnit notchIIR1 of type IP_IIR2</description>
          <addressOffset>0x6F4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COEFFS_A2</name>
              <description>Signed filter coefficient A2</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR_CKSEL</name>
          <description>Clock select register for the PUnit decFIR of type IP_FIR</description>
          <addressOffset>0x6F8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>CKSEL</name>
              <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ClkSel_32M</name>
                  <description>CKSEL_32M</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_16M</name>
                  <description>CKSEL_16M</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_8M</name>
                  <description>CKSEL_8M</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_4M</name>
                  <description>CKSEL_4M</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_2M</name>
                  <description>CKSEL_2M</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_1M</name>
                  <description>CKSEL_1M</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_500K</name>
                  <description>CKSEL_500K</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSel_Bypass</name>
                  <description>CKSEL_BYPASS</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR_SOURCE</name>
          <description>Source select register for the PUnit decFIR of type IP_FIR</description>
          <addressOffset>0x6FC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>SOURCE</name>
              <description>Data source select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Src_IIR0</name>
                  <description>SRC_IIR0 (NOT LEGAL)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src_IIR1</name>
                  <description>SRC_IIR1 (NOT LEGAL)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src_NotChIIR0</name>
                  <description>SRC_NOTCHIIR0 (NOT LEGAL)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src_NotChIIR1</name>
                  <description>SRC_NOTCHIIR1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src_DecFIR</name>
                  <description>SRC_DECFIR</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src_InMain</name>
                  <description>SRC_INMAIN (NOT LEGAL)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR_CONTROL</name>
          <description>Control register for the PUnit decFIR of type IP_FIR</description>
          <addressOffset>0x700</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>TAPSEL</name>
              <description>Tap-select: number of active taps minus 2</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR_COEFFS_0</name>
          <description>Coefficient register 0 for the PUnit decFIR of type IP_FIR</description>
          <addressOffset>0x704</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>COEFFS_0</name>
              <description>Signed filter coefficient 0</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR_COEFFS_1</name>
          <description>Coefficient register 1 for the PUnit decFIR of type IP_FIR</description>
          <addressOffset>0x708</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>COEFFS_1</name>
              <description>Signed filter coefficient 1</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR_COEFFS_2</name>
          <description>Coefficient register 2 for the PUnit decFIR of type IP_FIR</description>
          <addressOffset>0x70C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000018</resetValue>
          <fields>
            <field>
              <name>COEFFS_2</name>
              <description>Signed filter coefficient 2</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR_COEFFS_3</name>
          <description>Coefficient register 3 for the PUnit decFIR of type IP_FIR</description>
          <addressOffset>0x710</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>COEFFS_3</name>
              <description>Signed filter coefficient 3</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR_COEFFS_4</name>
          <description>Coefficient register 4 for the PUnit decFIR of type IP_FIR</description>
          <addressOffset>0x714</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COEFFS_4</name>
              <description>Signed filter coefficient 4</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DECFIR_COEFFS_5</name>
          <description>Coefficient register 5 for the PUnit decFIR of type IP_FIR</description>
          <addressOffset>0x718</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COEFFS_5</name>
              <description>Signed filter coefficient 5</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CFO_STAT</name>
          <description>Carrier freq. offset estimate</description>
          <addressOffset>0x800</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Readout of last valid decision level set in BitSlicer (signed)</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>LASTDEMODACTIVE</name>
              <description>0: Standard mode was used last 1: Hypermode was last used</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>PHASE</name>
              <description>Readout of last valid phase set in correlator (hypermode only) (signed)</description>
              <lsb>16</lsb>
              <msb>28</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PB_TEST</name>
          <description>Test: PB calibration</description>
          <addressOffset>0x804</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000880</resetValue>
          <fields>
            <field>
              <name>PBIBPSTRIM</name>
              <description>Trim code for IBPS currents</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>VBGTRIM</name>
              <description>Trim code for VBG to FS_VCOREG</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>OVRENPBIBPSTRIM</name>
              <description>if '1' enable override for PBIBPSTRIM</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>OVRENVBGTRIM</name>
              <description>if '1' enable override for VBGTRIM</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DBC_COEFFS</name>
          <description>Test and Debug: DBC coefficients override</description>
          <addressOffset>0x808</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PADDRUPDATEOVREN</name>
              <description>paddrUpdateOvrEn</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>PADDRUPDATEOVRVAL</name>
              <description>paddrUpdateOvrVal</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>OVRALWAYSUPDATE</name>
              <description>Zero means coefficients only updated when needed (default), set to 1 coefficients are always updated when the radio is enabled.</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE4</name>
          <description>Trim value override register 4 for nRF52</description>
          <addressOffset>0x80C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00140000</resetValue>
          <fields>
            <field>
              <name>PREAMBFILTTH</name>
              <description>Threshold for the preamble filter</description>
              <lsb>16</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>ENPREAMBFILT</name>
              <description>Enable preamble filter</description>
              <lsb>25</lsb>
              <msb>25</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE5</name>
          <description>Trim value override register 5 for nRF52</description>
          <addressOffset>0x810</addressOffset>
          <access>read-write</access>
          <resetValue>0x00060020</resetValue>
          <fields>
            <field>
              <name>PREAMBFILTCYCLES</name>
              <description>Override value for preambFiltCycles</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>BITSLICERSWINGTH</name>
              <description>Override value for bitSlicerSwingTh</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>PREAMBFILTMINSTRLEN</name>
              <description>Override value for preambFiltMinStrLen</description>
              <lsb>16</lsb>
              <msb>18</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE6</name>
          <description>Trim value override register 6 for nRF52</description>
          <addressOffset>0x814</addressOffset>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <fields>
            <field>
              <name>DBCENABLESRC</name>
              <description>Override value for dbcEnableSrc</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AlwaysOn</name>
                  <description>Always on when not address match</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BBLogMag</name>
                  <description>When bbLogMag is above a threshold</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BitSlicerSwing</name>
                  <description>When a certain time has gone since the input to the bitslicer was above BITSLICERSWINGTH</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Both</name>
                  <description>Both BBLogMag and BitSlicerSwing</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBCTIMEOUT</name>
              <description>Override value for correlator timeout,in bit periods (hypermode)</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>DBCENABLETH</name>
              <description>Override value for correlator enable threshold</description>
              <lsb>24</lsb>
              <msb>29</msb>
            </field>
            <field>
              <name>ENCHECKMULTIPEAKS</name>
              <description>Enable checking of several correlator peaks in hypermode</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>DBCCORRTHEN</name>
              <description>Override value enable for DBCCORRTH and MFBSTRBOFFSET</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE9</name>
          <description>Trim value override register 9 for nRF52</description>
          <addressOffset>0x818</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>PSDDEMODDELAY</name>
              <description>Override value for psdDemodDelay (standard mode)</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>DEMODINVERT</name>
              <description>Override value for demodInvert (standard and hyper)</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>BITSLICERSWINGTIME</name>
              <description>Bit slicer swing time</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>SCALERDECAYDELAY</name>
              <description>Decay delay for the IQ scaler</description>
              <lsb>20</lsb>
              <msb>25</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE12</name>
          <description>Trim value override register 12 for nRF52</description>
          <addressOffset>0x824</addressOffset>
          <access>read-write</access>
          <resetValue>0x01F4044C</resetValue>
          <fields>
            <field>
              <name>IFPKDETHIGHTHRES</name>
              <description>Override value for IfpkDetHighThres</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>SATDELAYCORRECTION</name>
              <description>Signed correction value for how much the saturation information is delayed from the input ADC samples to the samples being stored to RAM in direction finding operation</description>
              <lsb>12</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>IFPKDETLOWTHRES</name>
              <description>Override value for IfpkDetLowThres</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE23</name>
          <description>Trim value override register 23 for nRF52</description>
          <addressOffset>0x828</addressOffset>
          <access>read-write</access>
          <resetValue>0x00002848</resetValue>
          <fields>
            <field>
              <name>OVRENCNRIPPLEWARNCFG</name>
              <description>Override enable for CNPEAKMINTHR and CNABSMAXTHR in the CNRIPPLEWARNCFG register</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>ENABLEFEEDBACK</name>
              <description>Enable decision feedback for matched filter bank</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>HIGHERTHANMARGINDBC</name>
              <description>Required peak height required for a double correlator peak to be considered higher than previous ones. The register value will be multiplied by 25 to obtain the actual margin. The bitfield is NOT subject to the enable override at bit position 31, and will always be enabled for hypermode.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>KEEPSTDINDSSS</name>
              <description>Keep standard demod in DSSS mode</description>
              <lsb>16</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>DISABLESYMBOLTRACK</name>
              <description>Disable symbol tracking for IEEE 802.15.4 and BLE LR modes</description>
              <lsb>17</lsb>
              <msb>17</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>STTCNFG_LR</name>
          <description>Strobe time tracking configuration in long range mode</description>
          <addressOffset>0x82C</addressOffset>
          <access>read-write</access>
          <resetValue>0x000010FA</resetValue>
          <fields>
            <field>
              <name>STTERRORTHLR</name>
              <description>Strobe time tracking error threshold in BLE LR mode</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>STTTIMEOUTLR</name>
              <description>Strobe time tracking timeout in BLE LR mode</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LELRMISC</name>
          <description>Miscellaneous Controls for Long Range</description>
          <addressOffset>0x830</addressOffset>
          <access>read-write</access>
          <resetValue>0x58780114</resetValue>
          <fields>
            <field>
              <name>LRFRAMERRTRSH</name>
              <description>Framer Receive Threshold</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>VITERBIUSESTATEZERO</name>
              <description>Use Viterbi state zero when flushing out bits for BLE LR</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>KEEPMFBONINBLELR125</name>
              <description>Do not stop the clock to RxMFB in BLE LR 125 mode</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>KEEPDESPREADONINBLELR500</name>
              <description>Do not stop the clock to the Despreader in BLE LR 500 mode</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>DISABLEFRAMESYNCLRTIMEOUT</name>
              <description>Disable framesync timeout (early address match timeout) for BLE LR mode (hypermode).</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>LELROFFADDRCHECK</name>
              <description>The number of chip periods earlier which it is allowed to declare frameSync in DecodeLELong</description>
              <lsb>8</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>CODEPOLY0</name>
              <description>Code Polynom 0</description>
              <lsb>16</lsb>
              <msb>22</msb>
            </field>
            <field>
              <name>CODEPOLY1</name>
              <description>Code Polynom 1</description>
              <lsb>24</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>LRDESPREADSWAP</name>
              <description>Swap de-spreader</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
