adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>DRIFT_LR</name>
          <description>Drift Controls in Long Range</description>
          <addressOffset>0x834</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000033C</resetValue>
          <fields>
            <field>
              <name>DRIFTHALPHA125</name>
              <description>Override value for IIR feedback , drift estimator (despreadLELLong)</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>DRIFTVALIDTH125</name>
              <description>Override value for driftValidTh, drift estimator (despreadLELLong)</description>
              <lsb>8</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>DRIFTLOWTH125</name>
              <description>Override value for driftLowTh, drift estimator (despreadLELLong)</description>
              <lsb>24</lsb>
              <msb>29</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE25</name>
          <description>TODO</description>
          <addressOffset>0x838</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DBCCORRTHSTRICT</name>
              <description>Correlation threshold for double correlator used in BleLr mode to resync to another preamble while already working on a previous preamble.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>DBCCORRTHPREVREQUIR</name>
              <description>Correlation threshold for double correlator used in BleLr mode to reject a later resync using DBCCORRTHSTRICT.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>MINPEAKCOUNTSTRICT</name>
              <description>Min number of peaks to detect before resyncing to another preamble while already working on a previous preamble in BleLrx.</description>
              <lsb>16</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>DBCPEAKDETSEL</name>
              <description>DBC peak detector selection</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Classic</name>
                  <description>Use classic peak detector (backward compatible behavior)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Differential</name>
                  <description>Use differential peak detector</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVRENDBCCORRTHSTRICT</name>
              <description>Override enable for DBCCORRTHSTRICT</description>
              <lsb>28</lsb>
              <msb>28</msb>
            </field>
            <field>
              <name>OVRENDBCCORRTHPREVREQUIR</name>
              <description>Override enable for DBCCORRTHPREVREQUIR</description>
              <lsb>29</lsb>
              <msb>29</msb>
            </field>
            <field>
              <name>OVRENMINPEAKCOUNTSTRICT</name>
              <description>Override enable for MINPEAKCOUNTSTRICT</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DBCPEAKDETTHR</name>
          <description>Thresholds for each peak detector instance</description>
          <addressOffset>0x83C</addressOffset>
          <access>read-write</access>
          <resetValue>0x0C0C0C0C</resetValue>
          <fields>
            <field>
              <name>THR0</name>
              <description>Diff threshold 0</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>THR1</name>
              <description>Diff threshold 1</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>THR2</name>
              <description>Diff threshold 2</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>THR3</name>
              <description>Diff threshold 3</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BITSLICER_STAT</name>
          <description>Payload status</description>
          <addressOffset>0x840</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SUM_MIN</name>
              <description>Number of received zeros</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>SUM_MAX</name>
              <description>Number of received ones</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BBCTRL</name>
          <description>Miscellaneous mode bits</description>
          <addressOffset>0x844</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000110</resetValue>
          <fields>
            <field>
              <name>BLELONGRANGE</name>
              <description>Enable long range mode (enabling both 15.4 and long range is not legal)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>BLELONGRANGE_NO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>BLELONGRANGE_YES</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IEEE802154</name>
              <description>Enable 15.4 mode (enabling both 15.4 and long range is not legal)</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>IEEE802154_NO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>IEEE802154_YES</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEMODFILTMODE</name>
              <description>Decimation mode in PantherDemodFilt</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Decimation_2M</name>
                  <description>DEMODFILTMODE_2M</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Decimation_1M</name>
                  <description>DEMODFILTMODE_1M</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved_2</name>
                  <description>DEMODFILTMODE_RESERVED2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Decimation_250K</name>
                  <description>DEMODFILTMODE_250K</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved_4</name>
                  <description>DEMODFILTMODE_RESERVED4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved_5</name>
                  <description>DEMODFILTMODE_RESERVED5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved_6</name>
                  <description>DEMODFILTMODE_RESERVED6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved_7</name>
                  <description>DEMODFILTMODE_RESERVED7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODINDEX</name>
              <description>Modulation index for RxDBCCoeffGen and RxMFB</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ModIndex_0h25</name>
                  <description>MODINDEX_0H25</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ModIndex_0h32</name>
                  <description>MODINDEX_0H32</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ModIndex_0h5</name>
                  <description>MODINDEX_0H5</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ModIndex_1h0</name>
                  <description>MODINDEX_1H0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ModIndex_2h0</name>
                  <description>MODINDEX_2H0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved_5</name>
                  <description>MODINDEX_RESERVED5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved_6</name>
                  <description>MODINDEX_RESERVED6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved_7</name>
                  <description>MODINDEX_RESERVED7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBCCORR</name>
          <description>Thresholds for the double correlator</description>
          <addressOffset>0x848</addressOffset>
          <access>read-write</access>
          <resetValue>0x1FFFFF90</resetValue>
          <fields>
            <field>
              <name>TH</name>
              <description>Correlation threshold for double correlator in normal operation</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>STRICT</name>
              <description>Correlation threshold for double correlator used in BleLr mode to resync to another preamble while already working on a previous preamble. Also applies for Ieee 802.15.4 mode</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>PREVREQUIR</name>
              <description>Correlation threshold for double correlator used in BleLr mode to reject a later resync using DBCCORRTHSTRICT. Also applies for Ieee 802.15.4 mode</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>ADDRTIMEOUT</name>
              <description>Override value for address match timeout, [in bit periods] (hypermode). 0 means no timeout. If BALEN is 3, the actual value of DBCADDRTIMEOUT will be the value written to this register minus 8.</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DSSS</name>
          <description>DSSS synchronizer trim values</description>
          <addressOffset>0x84C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000202</resetValue>
          <fields>
            <field>
              <name>PEAKDISTTOL</name>
              <description>Override for dsssPeakDistanceTolerance</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>MINPEAKCOUNT</name>
              <description>Override for dsssMinPeakCount</description>
              <lsb>8</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>MINPEAKCOUNTSTRICT</name>
              <description>Min number of peaks to detect before resyncing to another preamble while already working on a previous preamble in BleLrx. Also applies for Ieee 802.15.4 mode</description>
              <lsb>16</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>ENCFOAVE</name>
              <description>Enable CFO averaging</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>ENSTAVE</name>
              <description>Enable strobe time averaging</description>
              <lsb>25</lsb>
              <msb>25</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BSCONFIG</name>
          <description>Bitslicer configuration</description>
          <addressOffset>0x850</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000205A</resetValue>
          <fields>
            <field>
              <name>BITLENGTHTOLERANSE</name>
              <description>Override for bsBitLengthToleranse</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>DISABLEPREAMBLEBLOCK</name>
              <description>Override for bsDisablePreambleBlock</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>ENABLETHRESHOLDADJUST</name>
              <description>Override for bsEnableThresholdAdjust</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>DATAPEAK2PEAK</name>
              <description>Override for bsDataPeak2Peak</description>
              <lsb>4</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>STROBEDATAIN</name>
              <description>Override for bsStrobeDataIn</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>STROBEDELAY</name>
              <description>Override for bsStrobeDelay</description>
              <lsb>12</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>YLEVALG</name>
              <description>Override for bsYlevAlg</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MFB</name>
          <description>Matched Filter Bank (MFB) configuration</description>
          <addressOffset>0x854</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>STRBOFFSET</name>
              <description>Override value for strobe offset</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>BYPASSMAJVOTE</name>
              <description>Bypass majority vote</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>Majority vite</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASS</name>
                  <description>Bypass through majority vote</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DRIFT1</name>
          <description>Drift Estimator configuration</description>
          <addressOffset>0x858</addressOffset>
          <access>read-write</access>
          <resetValue>0x00002820</resetValue>
          <fields>
            <field>
              <name>ALPHA</name>
              <description>Override value for IIR feedback , drift estimator (hypermode)</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>VALIDTH</name>
              <description>Override value for driftValidTh, drift estimator (hypermode)</description>
              <lsb>8</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>SATENABLEALWAYS</name>
              <description>Enable saturation in drift calculator for all modes</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DRIFT2</name>
          <description>Drift Estimator configuration</description>
          <addressOffset>0x85C</addressOffset>
          <access>read-write</access>
          <resetValue>0x0C8A0008</resetValue>
          <fields>
            <field>
              <name>LOWTH</name>
              <description>Override value for driftLowTh, drift estimator (hypermode)</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>MAXDIST</name>
              <description>Override value for driftMaxDist, drift estimator (hypermode)</description>
              <lsb>16</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>DELAYTH</name>
              <description>Override value for driftDelayTh, drift estimator (hypermode)</description>
              <lsb>20</lsb>
              <msb>28</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CN</name>
          <description>Configuration for the CNRIPPLEWARN functionality used for BLE LR. Configuration is only enabled when OVRENCNRIPPLEWARNCFG in OVERRIDE23 is set</description>
          <addressOffset>0x860</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PEAKMINTHR</name>
              <description>Required peak height compared to baseline level measured just before the peak at the double correlator output. If the peak height is below the threshold, it will be ignored. This feature is disabled when CNPEAKMINTHR is set to 0x0000.</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ABSMAXTHR</name>
              <description>maximum baseline value before the peak at the double correlator output. if the baseline value is above the threshold, the following peak will be ignored. this value is ignored when CNABSMAXTHR is set to 0x0000.</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PEAK</name>
          <description>Peak detector configuration</description>
          <addressOffset>0x864</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>ENMAYBESIDELOBE</name>
              <description>Ignore peaks from DBC which look like sidelobes</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>ENADUALDISTANCE</name>
              <description>Allow dual distance between peaks</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>STTCNFG</name>
          <description>Strobe time tracking Configuration (Symbol Timing)</description>
          <addressOffset>0x868</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STTALPHA</name>
              <description>Strobe time tracking: IIR filter alpha</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>STTERRORTH</name>
              <description>Strobe time tracking: strobe time error threshold</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>STTTIMEOUT</name>
              <description>Strobe time tracking: adjustment timeout (min distance in symbolperiods between strobe adjustments in same direction)</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
