adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>DFECTRL3</name>
          <description>Various hacker/tuning configuration for Direction finding</description>
          <addressOffset>0x910</addressOffset>
          <access>read-write</access>
          <resetValue>0x28433000</resetValue>
          <fields>
            <field>
              <name>SPACINGBETWEEN</name>
              <description>Signed tuning value for the spacing between the last sample in the reference period and the first sample in the first sample slot</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>SPACINGBETWEEN2US</name>
              <description>Same as SPACINGBETWEEN when using CTEINLINECTRL and CTEType is 2 us slots</description>
              <lsb>6</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>COMP4USSWITCHING</name>
              <description>Number of 4us periods to subtract from numberOf8us when calculating total number of antenna slots switches</description>
              <lsb>12</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>COMP4USSAMPLING</name>
              <description>Number of 4us periods to subtract from numberOf8us when calculating total number of samples to capture</description>
              <lsb>16</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>TGUARDPERIOD</name>
              <description>Length of GUARD period in number of microseconds, normally 4</description>
              <lsb>20</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TREFPERIOD</name>
              <description>Length of REFERENCE period in number of microseconds, normally 8</description>
              <lsb>24</lsb>
              <msb>28</msb>
            </field>
            <field>
              <name>CHANGESAMPLERATE</name>
              <description>Whether to have the ability to have separate sampling rate in the REFERENCE period vs the SWITCHING state</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Same</name>
                  <description>Always use sample spacing given by TSAMPLESPACINGREF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Change</name>
                  <description>Use TSAMPLESPACINGREF in the REFERENCE period, and TSAMPLESPACING or CTEINLINEAODRXMODExUS in the SWITCHING period</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MIRRORSEQUENCE</name>
              <description>When reaching the last antenna pattern, it repeats that pattern, and then goes back down again.</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Do not mirror the sequence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Mirror the sequence</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHORTENMIRRORSEQUENCE</name>
              <description>Applies only when MIRRORSEQUENCE is set. Selects whether to repeat the end pattern (in both ends) or not</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>End patterns are repeated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>End patterns are not repeated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DFECTRL4</name>
          <description>Various hacker/tuning configuration for Direction finding</description>
          <addressOffset>0x914</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFF7FF00</resetValue>
          <fields>
            <field>
              <name>SAMPLESTARTRELATIVETO</name>
              <description>Start point of TSAMPLEOFFSET sampling relative to which part in the switching state machine</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Reference</name>
                  <description>At the start of the reference antenna period</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Switching</name>
                  <description>At the start of antenna switching after the reference antenna period</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>When it is triggered Either TASKS_DFESTART, address match or AoA/AoD procedure trigger source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Guard</name>
                  <description>At the start of the GUARD period</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IGNORE8USLENGTH</name>
              <description>Ignore the length specification in numberOf8us</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DoNotIgnore</name>
                  <description>Use the length specification</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore the length specification</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IGNOREMAXSPEC</name>
              <description>Ignore the maximum number of samples and antenna slots specified with MAXTOTALSAMPLES and MAXTOTALSLOTS</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DoNotIgnore</name>
                  <description>Use the max specs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore the max specs</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWITCHBACKTOREF</name>
              <description>Insert reference antenna(SWITCHPATTERN[1]) between antenna switches, from SWITCHPATTERN[2] onwards</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Do not insert reference antenna between switches</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Insert reference antenna between switches</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IGNOREENDOFPACKET</name>
              <description>Ignore that the UTxRxChain says that the packet has been received Continue running if more time to run</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DoNotIgnore</name>
                  <description>Do not ignore the end of packet</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore the end of packet</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONESAMPLEPERSLOT</name>
              <description>TSAMPLESPACING is ignored for the samples taken in the SWITCHING state TSAMPLESPACINGREF is still used for the first samples (REFERENCE period)</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>DFECORREN</name>
              <description>Enable correlator before Direction Finding samples</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable correlator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable correlator</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAXTOTALSLOTS</name>
              <description>Maximum number of antenna slots</description>
              <lsb>8</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>RETURNTOREFATEND</name>
              <description>Start position of repeated part of switching pattern sequence</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Return to SWITCHPATTERN[2] after reaching the end of the switching pattern sequence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Return to SWITCHPATTERN[1] after reaching the end of the switching pattern sequence</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAXTOTALSAMPLES</name>
              <description>Maximum number of samples to capture</description>
              <lsb>20</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DFECTRL5</name>
          <description>Various hacker/tuning configuration for Direction finding</description>
          <addressOffset>0x918</addressOffset>
          <access>read-write</access>
          <resetValue>0x00010000</resetValue>
          <fields>
            <field>
              <name>SATURATIONMODE</name>
              <description>Set how input saturation will be present in the captured samples</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No saturation is presented</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETMINVAL</name>
                  <description>Saturation is marked by setting both I and Q to -32768 (or mag/phase if SAMPLETYPE is 1)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SATURATIONBIT</name>
                  <description>Bit 15 of both the I and Q values indicates saturation. I and Q are hence only 15 bit values</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NEVERIGNORESAT</name>
              <description>Selects whether saturation (being reported from the radio front-end) should be ignored in the beginning of the slot or not</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IGNORE</name>
                  <description>Saturation being indicated from the front-end is ignored if it happens in the first 40 percent of the sample spacing after a sample was saved to RAM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEVERIGNORE</name>
                  <description>Saturation is always reported in RAM if detected by the frontend</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFEOFFSETSTDHYP</name>
              <description>Tuning of the timing difference between the hypermode demodulator and the standard demodulator for the DFE start event, in 62.5 ns units</description>
              <lsb>24</lsb>
              <msb>28</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SWITCHPATTERN</name>
          <description>GPIO patterns to be used for each antenna</description>
          <addressOffset>0x91C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SWITCHPATTERN</name>
              <description>Fill array of GPIO patterns for antenna control</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CLEARPATTERN</name>
          <description>Clear the GPIO pattern array for antenna control</description>
          <addressOffset>0x920</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLEARPATTERN</name>
              <description>Clear the GPIO pattern array for antenna control Behaves as a task register, but does not have PPI nor IRQ</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DFEGPIO[%s]</name>
          <description>Description collection: Pin select for DFE pin n</description>
          <addressOffset>0x924</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PIN</name>
              <description>Pin number</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>PORT</name>
              <description>Port number</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>CONNECT</name>
              <description>Connection</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Connect</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_TRIG_START_DFE</name>
          <description>Unspecified</description>
          <addressOffset>0x944</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK_TRIG_START_DFE</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_TRIG_STOP_DFE</name>
          <description>Unspecified</description>
          <addressOffset>0x948</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK_TRIG_STOP_DFE</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE_DFE</name>
          <description>Unspecified</description>
          <addressOffset>0x94C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE_DFE</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PTRDFE</name>
          <description>Data pointer</description>
          <addressOffset>0x950</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OFFSET</name>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>BASE</name>
              <lsb>29</lsb>
              <msb>29</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AMOUNTDFE</name>
          <description>Number of samples transferred in the last transaction</description>
          <addressOffset>0x954</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AMOUNTDFE</name>
              <description>Number of samples transferred in the last transaction</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MAXCNTDFE</name>
          <description>Maximum number of buffer words to transfer</description>
          <addressOffset>0x958</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>MAXCNTDFE</name>
              <description>Maximum number of buffer words to transfer</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_CNTSTART</name>
          <description>Unspecified</description>
          <addressOffset>0xA00</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK_CNTSTART</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_CNTSTOP</name>
          <description>Unspecified</description>
          <addressOffset>0xA04</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK_CNTSTOP</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_CNTCLEAR</name>
          <description>Unspecified</description>
          <addressOffset>0xA08</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK_CNTCLEAR</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCSTATUS</name>
          <description>CRC status</description>
          <addressOffset>0xA0C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRCSTATUS</name>
              <description>CRC status of packet received</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRCError</name>
                  <description>Packet received with CRC error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRCOk</name>
                  <description>Packet received with CRC ok</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMATCH</name>
          <description>Received address</description>
          <addressOffset>0xA10</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXMATCH</name>
              <description>Received address</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCRC</name>
          <description>CRC field of previously received packet</description>
          <addressOffset>0xA14</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXCRC</name>
              <description>CRC field of previously received packet</description>
              <lsb>0</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DAI</name>
          <description>Device address match index</description>
          <addressOffset>0xA18</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DAI</name>
              <description>Device address match index</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
