adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>PDUSTAT</name>
          <description>Payload status</description>
          <addressOffset>0xA1C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PDUSTAT</name>
              <description>Status on payload length vs. PCNF1.MAXLEN</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LessThan</name>
                  <description>Payload less than PCNF1.MAXLEN</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GreaterThan</name>
                  <description>Payload greater than PCNF1.MAXLEN</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CISTAT</name>
              <description>Status on what rate packet is received with in Long Range</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LR125kbit</name>
                  <description>Frame is received at 125 kbps</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LR500kbit</name>
                  <description>Frame is received at 500 kbps</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNF0</name>
          <description>Packet configuration register 0</description>
          <addressOffset>0xA20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LFLEN</name>
              <description>Length on air of LENGTH field in number of bits.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>LENGTHINCL</name>
              <description>Include or exclude LENGTH field in RAM</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Automatic</name>
                  <description>Include LENGTH field in RAM only if LFLEN &amp;gt; 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S0LEN</name>
              <description>Length on air of S0 field in number of bytes.</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>S0INCL</name>
              <description>Include or exclude S0 field in RAM</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Automatic</name>
                  <description>Include S0 field only if S0LEN &amp;gt; 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S1LEN</name>
              <description>Length on air of S1 field in number of bits.</description>
              <lsb>16</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>S1INCL</name>
              <description>Include or exclude S1 field in RAM</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Automatic</name>
                  <description>Include S1 field in RAM only if S1LEN &amp;gt; 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Include</name>
                  <description>Always include S1 field in RAM independent of S1LEN</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CILEN</name>
              <description>Length of code indicator - long range</description>
              <lsb>22</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>PLEN</name>
              <description>Length of preamble on air. Decision point: TASKS_START task</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8bit</name>
                  <description>8-bit preamble</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16bit</name>
                  <description>16-bit preamble</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32bitZero</name>
                  <description>32-bit zero preamble - used for IEEE 802.15.4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LongRange</name>
                  <description>Preamble - used for BLE long range</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRCINC</name>
              <description>Indicates if LENGTH field contains CRC or not</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Exclude</name>
                  <description>LENGTH does not contain CRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Include</name>
                  <description>LENGTH includes CRC</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREAMPTRN</name>
              <description>Preamble pattern</description>
              <lsb>28</lsb>
              <msb>28</msb>
            </field>
            <field>
              <name>TERMLEN</name>
              <description>Length of TERM field in Long Range operation</description>
              <lsb>29</lsb>
              <msb>30</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNF0SEC</name>
          <description>Unspecified</description>
          <addressOffset>0xA24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIELD0</name>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>FIELD1</name>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>FIELD2</name>
              <lsb>16</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>FIELD3</name>
              <lsb>20</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>FIELD4</name>
              <lsb>22</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>FIELD5</name>
              <lsb>24</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>FIELD6</name>
              <lsb>26</lsb>
              <msb>26</msb>
            </field>
            <field>
              <name>FIELD7</name>
              <lsb>28</lsb>
              <msb>28</msb>
            </field>
            <field>
              <name>FIELD8</name>
              <lsb>29</lsb>
              <msb>30</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNF1</name>
          <description>Packet configuration register 1</description>
          <addressOffset>0xA28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MAXLEN</name>
              <description>Maximum length of packet payload. If the packet payload is larger than MAXLEN, the radio will truncate the payload to MAXLEN.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>STATLEN</name>
              <description>Static length in number of bytes</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>BALEN</name>
              <description>Base address length in number of bytes</description>
              <lsb>16</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>ENDIAN</name>
              <description>On-air endianness of packet, this applies to the S0, LENGTH, S1, and the PAYLOAD fields.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Little</name>
                  <description>Least significant bit on air first</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Big</name>
                  <description>Most significant bit on air first</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WHITEEN</name>
              <description>Enable or disable packet whitening</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFROMRAM</name>
              <description>Used to bypass PREAMBLE, ADDRESS, S0, LENGTH, S1 field and go straight to PAYLOAD state</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bypass</name>
                  <description>Bypass</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BASE0</name>
          <description>Base address 0</description>
          <addressOffset>0xA2C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BASE0</name>
              <description>Base address 0</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BASE1</name>
          <description>Base address 1</description>
          <addressOffset>0xA30</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BASE1</name>
              <description>Base address 1</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PREFIX0</name>
          <description>Prefixes bytes for logical addresses 0-3</description>
          <addressOffset>0xA34</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AP0</name>
              <description>Address prefix 0.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>AP1</name>
              <description>Address prefix 1.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>AP2</name>
              <description>Address prefix 2.</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>AP3</name>
              <description>Address prefix 3.</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PREFIX1</name>
          <description>Prefixes bytes for logical addresses 4-7</description>
          <addressOffset>0xA38</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AP4</name>
              <description>Address prefix 4.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>AP5</name>
              <description>Address prefix 5.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>AP6</name>
              <description>Address prefix 6.</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>AP7</name>
              <description>Address prefix 7.</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TXADDRESS</name>
          <description>Transmit address select</description>
          <addressOffset>0xA3C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXADDRESS</name>
              <description>Transmit address select</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RXADDRESSES</name>
          <description>Receive address select</description>
          <addressOffset>0xA40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDR0</name>
              <description>Enable or disable reception on logical address 0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR1</name>
              <description>Enable or disable reception on logical address 1.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR2</name>
              <description>Enable or disable reception on logical address 2.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR3</name>
              <description>Enable or disable reception on logical address 3.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR4</name>
              <description>Enable or disable reception on logical address 4.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR5</name>
              <description>Enable or disable reception on logical address 5.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR6</name>
              <description>Enable or disable reception on logical address 6.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR7</name>
              <description>Enable or disable reception on logical address 7.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYPER</name>
              <description>Hypermode settings</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B0</name>
                  <description>Use hypermode for address ADDR0 (base address 0 RADIO.BASE0)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B1</name>
                  <description>From all of the enabled addresses among ADDR1 through ADDR7, the address ADDRn with the highest index number 'n' will use hypermode (base address 1 RADIO.BASE1)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
