adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>CRCCNF</name>
          <description>CRC configuration</description>
          <addressOffset>0xA44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LEN</name>
              <description>CRC length in number of bytes.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>CRC length is zero and CRC calculation is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>One</name>
                  <description>CRC length is one byte and CRC calculation is enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Two</name>
                  <description>CRC length is two bytes and CRC calculation is enabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Three</name>
                  <description>CRC length is three bytes and CRC calculation is enabled</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SKIPADDR</name>
              <description>Include or exclude packet address field out of CRC calculation.</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Include</name>
                  <description>CRC calculation includes address field</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Skip</name>
                  <description>CRC calculation does not include address field. The CRC calculation will start at the first byte after the address.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ieee802154</name>
                  <description>CRC calculation as per 802.15.4 standard. Starting at first byte after length field.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCPOLY</name>
          <description>CRC polynomial</description>
          <addressOffset>0xA48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRCPOLY</name>
              <description>CRC polynomial</description>
              <lsb>0</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCINIT</name>
          <description>CRC initial value</description>
          <addressOffset>0xA4C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRCINIT</name>
              <description>CRC initial value</description>
              <lsb>0</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DAB[%s]</name>
          <description>Description collection: Device address base segment n</description>
          <addressOffset>0xA50</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DAB</name>
              <description>Device address base segment n</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DAP[%s]</name>
          <description>Description collection: Device address prefix n</description>
          <addressOffset>0xA70</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DAP</name>
              <description>Device address prefix n</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DACNF</name>
          <description>Device address match configuration</description>
          <addressOffset>0xA90</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENA0</name>
              <description>Enable or disable device address matching using device address 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA1</name>
              <description>Enable or disable device address matching using device address 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA2</name>
              <description>Enable or disable device address matching using device address 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA3</name>
              <description>Enable or disable device address matching using device address 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA4</name>
              <description>Enable or disable device address matching using device address 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA5</name>
              <description>Enable or disable device address matching using device address 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA6</name>
              <description>Enable or disable device address matching using device address 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA7</name>
              <description>Enable or disable device address matching using device address 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXADD0</name>
              <description>TxAdd for device address 0</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>TXADD1</name>
              <description>TxAdd for device address 1</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>TXADD2</name>
              <description>TxAdd for device address 2</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>TXADD3</name>
              <description>TxAdd for device address 3</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>TXADD4</name>
              <description>TxAdd for device address 4</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>TXADD5</name>
              <description>TxAdd for device address 5</description>
              <lsb>13</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>TXADD6</name>
              <description>TxAdd for device address 6</description>
              <lsb>14</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>TXADD7</name>
              <description>TxAdd for device address 7</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BCC</name>
          <description>Bit counter compare</description>
          <addressOffset>0xA94</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BCC</name>
              <description>Bit counter compare</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AACHKOVERRIDE_TODO_FIX_NAMING</name>
          <description>Unspecified</description>
          <addressOffset>0xA98</addressOffset>
          <access>read-write</access>
          <resetValue>0x02600000</resetValue>
          <fields>
            <field>
              <name>FIELD0</name>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>FIELD1</name>
              <lsb>17</lsb>
              <msb>17</msb>
            </field>
            <field>
              <name>FIELD2</name>
              <lsb>18</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>FIELD3</name>
              <lsb>19</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>FIELD4</name>
              <lsb>20</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>FIELD5</name>
              <lsb>21</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>FIELD6</name>
              <lsb>22</lsb>
              <msb>22</msb>
            </field>
            <field>
              <name>FIELD7</name>
              <lsb>24</lsb>
              <msb>26</msb>
            </field>
            <field>
              <name>FIELD8</name>
              <lsb>28</lsb>
              <msb>29</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKETCNTR1</name>
          <description>Unspecified</description>
          <addressOffset>0xA9C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIELD0</name>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKETCNTR2</name>
          <description>Unspecified</description>
          <addressOffset>0xAA0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIELD0</name>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>FIELD1</name>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CTESTATUS</name>
          <description>CTEInfo parsed from received packet</description>
          <addressOffset>0xAA4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTETIME</name>
              <description>CTETime parsed from packet</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>RFU</name>
              <description>RFU parsed from packet</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>CTETYPE</name>
              <description>CTEType parsed from packet</description>
              <lsb>6</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HYPSTDCHECKSTAT_TODO_FIX_NAMING</name>
          <description>Unspecified</description>
          <addressOffset>0xAA8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIELD0</name>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>FIELD1</name>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>FIELD2</name>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>FIELD3</name>
              <lsb>16</lsb>
              <msb>24</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HYPSTDAADIFFVEC_TODO_FIX_NAMING</name>
          <description>Unspecified</description>
          <addressOffset>0xAAC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIELD0</name>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRSAFECONF</name>
          <description>Unspecified</description>
          <addressOffset>0xAB0</addressOffset>
          <access>read-write</access>
          <resetValue>0x1D111518</resetValue>
          <fields>
            <field>
              <name>FIELD0</name>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>FIELD1</name>
              <lsb>8</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>FIELD2</name>
              <lsb>16</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>FIELD3</name>
              <lsb>24</lsb>
              <msb>28</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MHRMATCHCONF</name>
          <description>Search pattern configuration</description>
          <addressOffset>0xAB4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MHRMATCHCONF</name>
              <description>Search pattern configuration</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MHRMATCHMASK</name>
          <description>Pattern mask</description>
          <addressOffset>0xAB8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MHRMATCHMASK</name>
              <description>Pattern mask</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SFD</name>
          <description>IEEE 802.15.4 start of frame delimiter</description>
          <addressOffset>0xABC</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000A7</resetValue>
          <fields>
            <field>
              <name>SFD</name>
              <description>IEEE 802.15.4 start of frame delimiter</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
