adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>CTEINLINECONF</name>
          <description>Configuration for CTE inline mode</description>
          <addressOffset>0xAC0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00002800</resetValue>
          <fields>
            <field>
              <name>CTEINLINECTRLEN</name>
              <description>Enable parsing of CTEInfo from received packet in BLE modes</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Parsing of CTEInfo is enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Parsing of CTEInfo is disabled</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTEINFOINS1</name>
              <description>CTEInfo is S1 byte or not</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InS1</name>
                  <description>CTEInfo is in S1 byte (data PDU)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotInS1</name>
                  <description>CTEInfo is NOT in S1 byte (advertising PDU)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTEERRORHANDLING</name>
              <description>Sampling/switching if CRC is not OK</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Yes</name>
                  <description>Sampling and antenna switching also when CRC is not OK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>No</name>
                  <description>No sampling and antenna switching when CRC is not OK</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTEFORCEON</name>
              <description>CTE is continuously output after CRC and only stopped by triggering TASKS_STOP. This is typically used together with the DFEEND to STOP short. AoA/AoD procedure duration is still controlled by DFECTRL1.NUMBEROF8S / CTETIME</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Yes</name>
                  <description>CTE is continuously transmitted after CRC until TASKS_STOP</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>No</name>
                  <description>CTE duration is automatically determined by DFECTRL1.NUMBEROF8US / CTETIME (only correct for 1Mbps and 2Mbps modes)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTETIMEVALIDRANGE</name>
              <description>Max range of CTETime</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>20</name>
                  <description>20 in 8us unit (default) Set to 20 if parsed CTETime is larger han 20</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>31</name>
                  <description>31 in 8us unit</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>63</name>
                  <description>63 in 8us unit</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTEINLINERXMODE1US</name>
              <description>Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set</description>
              <lsb>10</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8us</name>
                  <description>8us</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4us</name>
                  <description>4us</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2us</name>
                  <description>2us</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1us</name>
                  <description>1us</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500ns</name>
                  <description>0.5us</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>250ns</name>
                  <description>0.25us</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>125ns</name>
                  <description>0.125us</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTEINLINERXMODE2US</name>
              <description>Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8us</name>
                  <description>8us</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4us</name>
                  <description>4us</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2us</name>
                  <description>2us</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1us</name>
                  <description>1us</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500ns</name>
                  <description>0.5us</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>250ns</name>
                  <description>0.25us</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>125ns</name>
                  <description>0.125us</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S0CONF</name>
              <description>S0 bit pattern to match</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>S0MASK</name>
              <description>S0 bit mask to set which bit to match</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_TRIG_START_CHAIN</name>
          <description>Unspecified</description>
          <addressOffset>0xAC4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK_TRIG_START_CHAIN</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_TRIG_STOP_CHAIN</name>
          <description>Unspecified</description>
          <addressOffset>0xAC8</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK_TRIG_STOP_CHAIN</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE_CHAIN</name>
          <description>Unspecified</description>
          <addressOffset>0xACC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE_CHAIN</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKETPTR</name>
          <description>Packet pointer</description>
          <addressOffset>0xAD0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OFFSET</name>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>BASE</name>
              <lsb>29</lsb>
              <msb>29</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AMOUNT_CHAIN</name>
          <description>Unspecified</description>
          <addressOffset>0xAD4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AMOUNT_CHAIN</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MAXCNT_CHAIN</name>
          <description>Unspecified</description>
          <addressOffset>0xAD8</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>MAXCNT_CHAIN</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCONFIG</name>
          <description>Tx configuration-</description>
          <addressOffset>0xB00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00405878</resetValue>
          <fields>
            <field>
              <name>CODEPOLY0</name>
              <description>Code polynomial 0</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>CODEPOLY1</name>
              <description>Code polynomial 1</description>
              <lsb>8</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>LRSPREADSWAP</name>
              <description>Swap pattern mapping. Default 0, 0 is mapped to a 0011 sequence, 1 is mapped to a 1100 sequence. If swap bit is set, 1 is mapped to a 0011 sequence, 0 is mapped to a 1100 sequence.</description>
              <lsb>16</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>BYPASSPRECODE</name>
              <description>Bypass MSK precoding.</description>
              <lsb>17</lsb>
              <msb>17</msb>
            </field>
            <field>
              <name>IQMODENABLE</name>
              <description>Enable IQ modulator.</description>
              <lsb>18</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>IQMODSYMBOL</name>
              <description>IQMOD additional symbol mapping not set by MODE.</description>
              <lsb>19</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>IQMODBT</name>
              <description>IQMOD GFSK bandwidth.</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0bt55</name>
                  <description>0bt55</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0bt60</name>
                  <description>0bt60</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved_2</name>
                  <description>MODBT_RESERVED2</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IQMODINDEX</name>
              <description>IQMOD modulation index.</description>
              <lsb>25</lsb>
              <msb>27</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ModIndex_0h25</name>
                  <description>MODINDEX_0H25</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ModIndex_0h32</name>
                  <description>MODINDEX_0H32</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ModIndex_0h5</name>
                  <description>MODINDEX_0H5</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ModIndex_1h0</name>
                  <description>MODINDEX_1H0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ModIndex_2h0</name>
                  <description>MODINDEX_2H0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved_5</name>
                  <description>MODINDEX_RESERVED5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved_6</name>
                  <description>MODINDEX_RESERVED6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved_7</name>
                  <description>MODINDEX_RESERVED7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IEEE802154</name>
              <description>Enable 15.4 mode (Do not enable both IEEE802154 and BLELONGRANGE)</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>IEEE802154_NO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>IEEE802154_YES</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLELONGRANGE</name>
              <description>Enable long range mode (Do not enable both IEEE802154 and BLELONGRANGE)</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>BLELONGRANGE_NO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>BLELONGRANGE_YES</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLCOMMAND</name>
          <description>Send or receive command directly to the AdPll digital island. Only write to this register when FSASYNCBUSBUSY returns 0</description>
          <addressOffset>0xC00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADPLLCOMMAND</name>
              <description>Controls the asynch interface, bits[27:16] are address, bits [15:0] are command/data field</description>
              <lsb>0</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>READ</name>
              <description>When 1, a read transaction is initiated. When the event COMPLETETRANS is set, read back this register</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FSFREQFINETUNE</name>
          <description>For finetuning the frequency</description>
          <addressOffset>0xC04</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FSFREQFINETUNE</name>
              <description>2-complement number for fine-tuning the frequency in steps of 488.28 Hz</description>
              <lsb>0</lsb>
              <msb>12</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVIATION</name>
          <description>Frequency deviation for modulation</description>
          <addressOffset>0xC08</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000055</resetValue>
          <fields>
            <field>
              <name>DEVIATION</name>
              <description>Frequency deviation for modulation</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MODRATE</name>
          <description>Select modulation rate</description>
          <addressOffset>0xC0C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>MODRATE</name>
              <description>Select modulation rate</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>250k</name>
                  <description>250 kbps</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500k</name>
                  <description>500 kbps</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1M</name>
                  <description>1 Mbps</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2M</name>
                  <description>2 Mbps</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4M</name>
                  <description>4 Mbps</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MODFILTERING</name>
          <description>Select gaussian filtering mode</description>
          <addressOffset>0xC10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>MODFILTERING</name>
              <description>Select gaussian filtering mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>None</name>
                  <description>No filtering</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0bt55</name>
                  <description>Gfsk Bt=0.55</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0bt60</name>
                  <description>Gfsk Bt=0.60</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CUSTOMMODULATION</name>
          <description>Enable reading from memory and passing data over to AdPll</description>
          <addressOffset>0xC14</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable reading from memory and passing data over to AdPll</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FSCLOCKSELECT</name>
          <description>Set the clock source for the AdPll digital island</description>
          <addressOffset>0xC18</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>INTERNAL</name>
              <description>Set the clock source for the AdPll digital island when fsStart is high</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CORE</name>
              <description>Set the clock source for the AdPll digital island when fsStart is low</description>
              <lsb>2</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>STOP</name>
              <description>Force-stopping the clock internally in the AdPll island</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>OVRVAL</name>
              <description>Used instead of 'fsStart' if FSCLOCKSELECT.OVREN is set</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>OVREN</name>
              <description>Override enable for setting the clock switch. If 0, fsStart decides which clock to use. If 1, FSCLOCKSELECT.OVRVAL selects which clock to use</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
