adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>FSUNITRIGCALVAL</name>
          <description>Read the calibrated value for the universal trigger</description>
          <addressOffset>0xC1C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FSUNITRIGCALVAL</name>
              <description>Read the calibrated value for the universal trigger</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FSUNITRIGMANUAL</name>
          <description>Manual control of the uni trigger signals. Note that fsUniTriggerCalWord is controlled by writing to the separate register FSUNITRIGCALVAL</description>
          <addressOffset>0xC20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLEMANUAL</name>
              <description>Enable manual control</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>FSUNITRIGGER</name>
              <description>The fsUniTrigger signal when using manual control</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>FSUNITRIGGERCALEN</name>
              <description>The fsUniTriggerCalEn signal when using manual control</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>FSUNITRIGGERSRC</name>
              <description>The fsUniTriggerCalSrc signal when using manual control</description>
              <lsb>8</lsb>
              <msb>13</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FSUNITRIGCALOUT</name>
          <description>Read the signal directly from fsUniTriggerCalOut</description>
          <addressOffset>0xC24</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FSUNITRIGCALOUT</name>
              <description>Read the raw fsUniTriggerCalOut value</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FSASYNCBUSCONF</name>
          <description>Some special settings for the asynchronous bus configuration</description>
          <addressOffset>0xC28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>CHECKSTATUS</name>
              <description>When 1, every transaction uses 8 x 32 MHz clock cycles instead of 4 x 32 MHz clock cycles. Confirmation is received whether the transaction was actually received by AdPll.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>DISABLE_AUTO_SETTING</name>
              <description>Do not send settings at the beginning to AdPll</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CHECKSTATUS_AUTO</name>
              <description>When 1, check the first transaction during sending auto. If errorenous stop the state machine</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>IGNORE_CLOCK_STARTED</name>
              <description>The bus scheduler will not wait for AdPll to say clockStarted</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FSASYNCBUSBUSY</name>
          <description>Status bit indicating whether the bus is currently busy or not</description>
          <addressOffset>0xC2C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>FSASYNCBUSBUSY</name>
              <description>Whether the bus is currently busy or not</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>VARIOUS_BACKDOORS</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0xC30</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000310</resetValue>
          <fields>
            <field>
              <name>FLIP_SSEL</name>
              <description>If 0, we flip the interpretation of the sSel signal (to work around a bug if we have managed to flip it somewhere in the design process)</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>REQUEST_CLOCK_OVERRIDE</name>
              <description>In normal operation we request clock when pwrupFsLdoDig0 is set. By setting this to 1, we will request clock even when pwrupFsLdoDig0. This may be useful for current measurements of FS_DIG</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>OVR_EN_CK32MCORE</name>
              <description>Make it possible to manually control whether ck32MCore is sent to the AdPll digital island. Needed to test complete clock silence in the AdPll island. It can also be used to enable the clock activity on the clock net even when the clock is not selected.</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>OVR_VAL_CK32MCORE</name>
              <description>Whether ck32MCore is active or not when OVR_EN_CK32MCORE is set. See also description of OVR_EN_CK32MCORE</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>ON_THE_FLY_WILL_TRIGGER</name>
              <description>0: no relock, 1: first gear of TRK, 2: back to ACQ, 3: back to full lock</description>
              <lsb>4</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>RELOAD_FREQ_WILL_TRIGGER</name>
              <description>0: no relock, 1: first gear of TRK, 2: back to ACQ, 3: back to full lock</description>
              <lsb>8</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EXPECTEDPVTTOTRATIO</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0xC40</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>EXPECTEDPVTTOTRATIO</name>
              <description>The ratio between PVT and the total cap ratio. Used for Estkmod, Estkdtc and TdcReadout</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ESTKDTCVAL</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0xC44</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>ESTKDTVAL</name>
              <description>The estimated kDTV value in typical</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TXINTERFACEHFGAIN</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0xC48</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>TXINTERFACEHFGAIN</name>
              <description>The gain for the HF path</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TRACING</name>
          <description>Enable tracing from AdPll</description>
          <addressOffset>0xC4C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable tracing from AdPll</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IFFREQ</name>
          <description>Select between two different IF frequencies</description>
          <addressOffset>0xC50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HIGHIF</name>
              <description>Select between two different IF frequencies</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1MHz</name>
                  <description>1 MHz IF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2MHz</name>
                  <description>2 MHz IF</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLCOMPANIONSTATE</name>
          <description>State in the AdPllCompanion state machines</description>
          <addressOffset>0xC54</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BUSSCHEDULERSTATE</name>
              <description>The state of the state machine which sends commands automatically at startup</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>BUSMASTERSTATE</name>
              <description>The state of the async bus master</description>
              <lsb>4</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>CLOCKSWITCHSTATE</name>
              <description>The state of the clock switching state machine</description>
              <lsb>8</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>UNITRIGCALSTATE</name>
              <description>The state of the universal trigger calibration routine</description>
              <lsb>12</lsb>
              <msb>14</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RELOADFREQ</name>
          <description>Non-official task: AdPll will reread the frequency input signal</description>
          <addressOffset>0xC70</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRIGGER</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>UNITRIGCALSTART</name>
          <description>Non-official task: Start automatic universal trigger calibration</description>
          <addressOffset>0xC74</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRIGGER</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FSSENDSETTINGS</name>
          <description>Non-official task: Send the auto-settings to AdPll again. This also happens at every startup</description>
          <addressOffset>0xC78</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRIGGER</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>UNITRIGCALDONE</name>
          <description>Non-official event: Start automatic universal trigger calibration</description>
          <addressOffset>0xC80</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>REJECTEDTRANS</name>
          <description>Non-official event: The command written to AdPll was rejected because of an ongoing transaction</description>
          <addressOffset>0xC84</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>COMPLETETRANS</name>
          <description>Non-official event: Completed a transaction to AdPll successfully ((only when CHECKSTATUS is set)</description>
          <addressOffset>0xC88</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FAILEDTRANS</name>
          <description>Non-official event: Did not successfully complete a transaction to AdPll. (only when CHECKSTATUS is set)</description>
          <addressOffset>0xC8C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLL_STARTUP_COMMAND0</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0xCA0</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>The value to be written the register in the digital island</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>The address of the digital island to write to</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLL_STARTUP_COMMAND1</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0xCA4</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>The value to be written the register in the digital island</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>The address of the digital island to write to</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLL_STARTUP_COMMAND2</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0xCA8</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>The value to be written the register in the digital island</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>The address of the digital island to write to</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLL_STARTUP_COMMAND3</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0xCAC</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>The value to be written the register in the digital island</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>The address of the digital island to write to</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLL_STARTUP_COMMAND4</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0xCB0</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>The value to be written the register in the digital island</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>The address of the digital island to write to</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLL_STARTUP_COMMAND5</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0xCB4</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>The value to be written the register in the digital island</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>The address of the digital island to write to</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLL_STARTUP_COMMAND6</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0xCB8</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>The value to be written the register in the digital island</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>The address of the digital island to write to</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLL_STARTUP_COMMAND7</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0xCBC</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>The value to be written the register in the digital island</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>The address of the digital island to write to</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLCOMPANION_INTEN</name>
          <description>Unspecified</description>
          <addressOffset>0xCD0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADPLLCOMPANION_INTEN</name>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
