adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>ADPLLCOMPANION_INTENSET</name>
          <description>Unspecified</description>
          <addressOffset>0xCD4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <modifiedWriteValues>oneToSet</modifiedWriteValues>
          <fields>
            <field>
              <name>ADPLLCOMPANION_INTENSET</name>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLCOMPANION_INTENCLR</name>
          <description>Unspecified</description>
          <addressOffset>0xCD8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>ADPLLCOMPANION_INTENCLR</name>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLCOMPANION_INTPEND</name>
          <description>Unspecified</description>
          <addressOffset>0xCDC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADPLLCOMPANION_INTPEND</name>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_TXEN</name>
          <description>Unspecified</description>
          <addressOffset>0xD00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_RXEN</name>
          <description>Unspecified</description>
          <addressOffset>0xD04</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_START</name>
          <description>Unspecified</description>
          <addressOffset>0xD08</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_STOP</name>
          <description>Unspecified</description>
          <addressOffset>0xD0C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DISABLE</name>
          <description>Unspecified</description>
          <addressOffset>0xD10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_RSSISTART</name>
          <description>Unspecified</description>
          <addressOffset>0xD14</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_BCSTART</name>
          <description>Unspecified</description>
          <addressOffset>0xD18</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_BCSTOP</name>
          <description>Unspecified</description>
          <addressOffset>0xD1C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_EDSTART</name>
          <description>Unspecified</description>
          <addressOffset>0xD20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_EDSTOP</name>
          <description>Unspecified</description>
          <addressOffset>0xD24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_CCASTART</name>
          <description>Unspecified</description>
          <addressOffset>0xD28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_CCASTOP</name>
          <description>Unspecified</description>
          <addressOffset>0xD2C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DFESTART</name>
          <description>Unspecified</description>
          <addressOffset>0xD30</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DFESTOP</name>
          <description>Unspecified</description>
          <addressOffset>0xD34</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_ACQINJ0DMASTART</name>
          <description>Unspecified</description>
          <addressOffset>0xD38</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_ACQINJ0DMASTOP</name>
          <description>Unspecified</description>
          <addressOffset>0xD3C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_ACQINJ1DMASTART</name>
          <description>Unspecified</description>
          <addressOffset>0xD40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_ACQINJ1DMASTOP</name>
          <description>Unspecified</description>
          <addressOffset>0xD44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_CNTPSTART</name>
          <description>Unspecified</description>
          <addressOffset>0xD48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_CNTPSTOP</name>
          <description>Unspecified</description>
          <addressOffset>0xD4C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_CNTPCLEAR</name>
          <description>Unspecified</description>
          <addressOffset>0xD50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_LOOPBACKEN</name>
          <description>Unspecified</description>
          <addressOffset>0xD54</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_CALSTART</name>
          <description>Unspecified</description>
          <addressOffset>0xD58</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_CALSTOP</name>
          <description>Unspecified</description>
          <addressOffset>0xD5C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_PATESTSTART</name>
          <description>Unspecified</description>
          <addressOffset>0xD60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_PATESTSTOP</name>
          <description>Unspecified</description>
          <addressOffset>0xD64</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_CHNOINCR</name>
          <description>Unspecified</description>
          <addressOffset>0xD68</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DMASTART</name>
          <description>Unspecified</description>
          <addressOffset>0xD6C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DMASTOP</name>
          <description>Unspecified</description>
          <addressOffset>0xD70</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DFEDMASTART</name>
          <description>Unspecified</description>
          <addressOffset>0xD74</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DFEDMASTOP</name>
          <description>Unspecified</description>
          <addressOffset>0xD78</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_RESERVED31</name>
          <description>Unspecified</description>
          <addressOffset>0xD7C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_GETNEXTDETECT</name>
          <description>Unspecified</description>
          <addressOffset>0xD80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_CLEARDETECTFIFO</name>
          <description>Unspecified</description>
          <addressOffset>0xD84</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_RESETDEMODCTRL</name>
          <description>Unspecified</description>
          <addressOffset>0xD88</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DEMODCTRLSTARTTIMER</name>
          <description>Unspecified</description>
          <addressOffset>0xD8C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DEMODCTRLSTOPTIMER</name>
          <description>Unspecified</description>
          <addressOffset>0xD90</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DEMODCTRLCONDEN0</name>
          <description>Unspecified</description>
          <addressOffset>0xD94</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DEMODCTRLCONDEN1</name>
          <description>Unspecified</description>
          <addressOffset>0xD98</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_DEMODCTRLCONDEN2</name>
          <description>Unspecified</description>
          <addressOffset>0xD9C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
