adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>PUBLISH_READY</name>
          <description>Unspecified</description>
          <addressOffset>0xE00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_TXREADY</name>
          <description>Unspecified</description>
          <addressOffset>0xE04</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_RXREADY</name>
          <description>Unspecified</description>
          <addressOffset>0xE08</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_ADDRESS</name>
          <description>Unspecified</description>
          <addressOffset>0xE0C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_FRAMESTART</name>
          <description>Unspecified</description>
          <addressOffset>0xE10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_PAYLOAD</name>
          <description>Unspecified</description>
          <addressOffset>0xE14</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_END</name>
          <description>Unspecified</description>
          <addressOffset>0xE18</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_PHYEND</name>
          <description>Unspecified</description>
          <addressOffset>0xE1C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_DISABLED</name>
          <description>Unspecified</description>
          <addressOffset>0xE20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_DEVMATCH</name>
          <description>Unspecified</description>
          <addressOffset>0xE24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_DEVMISS</name>
          <description>Unspecified</description>
          <addressOffset>0xE28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_CRCOK</name>
          <description>Unspecified</description>
          <addressOffset>0xE2C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_CRCERROR</name>
          <description>Unspecified</description>
          <addressOffset>0xE30</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_RESERVED13</name>
          <description>Unspecified</description>
          <addressOffset>0xE34</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_BCMATCH</name>
          <description>Unspecified</description>
          <addressOffset>0xE38</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_EDEND</name>
          <description>Unspecified</description>
          <addressOffset>0xE3C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_EDSTOPPED</name>
          <description>Unspecified</description>
          <addressOffset>0xE40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_CCAIDLE</name>
          <description>Unspecified</description>
          <addressOffset>0xE44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_CCABUSY</name>
          <description>Unspecified</description>
          <addressOffset>0xE48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_CCASTOPPED</name>
          <description>Unspecified</description>
          <addressOffset>0xE4C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_RATEBOOST</name>
          <description>Unspecified</description>
          <addressOffset>0xE50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_MHRMATCH</name>
          <description>Unspecified</description>
          <addressOffset>0xE54</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_SYNC</name>
          <description>Unspecified</description>
          <addressOffset>0xE58</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_CTEPRESENT</name>
          <description>Unspecified</description>
          <addressOffset>0xE5C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_CTEWARNING</name>
          <description>Unspecified</description>
          <addressOffset>0xE60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_DFEEND</name>
          <description>Unspecified</description>
          <addressOffset>0xE64</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_MODEWRITTEN</name>
          <description>Unspecified</description>
          <addressOffset>0xE68</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_MODEREADY</name>
          <description>Unspecified</description>
          <addressOffset>0xE6C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_CTEEND</name>
          <description>Unspecified</description>
          <addressOffset>0xE70</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_LBREADY</name>
          <description>Unspecified</description>
          <addressOffset>0xE74</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_CALDONE</name>
          <description>Unspecified</description>
          <addressOffset>0xE78</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_CHNOUPDATED</name>
          <description>Unspecified</description>
          <addressOffset>0xE7C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_DBCTIMEOUT</name>
          <description>Unspecified</description>
          <addressOffset>0xE80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_TXTIMERMATCH</name>
          <description>Unspecified</description>
          <addressOffset>0xE84</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_RXTIMERMATCH</name>
          <description>Unspecified</description>
          <addressOffset>0xE88</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_RESERVED35</name>
          <description>Unspecified</description>
          <addressOffset>0xE8C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_RXDIGEN</name>
          <description>Unspecified</description>
          <addressOffset>0xE90</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_RAWDETECT</name>
          <description>Unspecified</description>
          <addressOffset>0xE94</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_DETECTFIFOFULL</name>
          <description>Unspecified</description>
          <addressOffset>0xE98</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_TIMERWRAPS</name>
          <description>Unspecified</description>
          <addressOffset>0xE9C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_STROBETIMETRACKUPDATED</name>
          <description>Unspecified</description>
          <addressOffset>0xEA0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_DEMODCTRLCONDTRIGGERED0</name>
          <description>Unspecified</description>
          <addressOffset>0xEA4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_DEMODCTRLCONDTRIGGERED1</name>
          <description>Unspecified</description>
          <addressOffset>0xEA8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
