adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>PUBLISH_DEMODCTRLCONDTRIGGERED2</name>
          <description>Unspecified</description>
          <addressOffset>0xEAC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_RESERVED44</name>
          <description>Unspecified</description>
          <addressOffset>0xEB0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_RESERVED45</name>
          <description>Unspecified</description>
          <addressOffset>0xEB4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_RESERVED46</name>
          <description>Unspecified</description>
          <addressOffset>0xEB8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_RESERVED47</name>
          <description>Unspecified</description>
          <addressOffset>0xEBC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_ACQINJ0DMAEND</name>
          <description>Unspecified</description>
          <addressOffset>0xEC0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_ACQINJ1DMAEND</name>
          <description>Unspecified</description>
          <addressOffset>0xEC4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT</name>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_TRIG_ZERO_PENALTY_PCP_4</name>
          <description>Unspecified</description>
          <addressOffset>0xF00</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK_TRIG_ZERO_PENALTY_PCP_4</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_TRIG_FULL_PENALTY_PCP_4</name>
          <description>Unspecified</description>
          <addressOffset>0xF04</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK_TRIG_FULL_PENALTY_PCP_4</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_TRIG_ZERO_PENALTY_PCP_3</name>
          <description>Unspecified</description>
          <addressOffset>0xF08</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK_TRIG_ZERO_PENALTY_PCP_3</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_TRIG_FULL_PENALTY_PCP_3</name>
          <description>Unspecified</description>
          <addressOffset>0xF0C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK_TRIG_FULL_PENALTY_PCP_3</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_TRIG_ZERO_PENALTY_PCP_2</name>
          <description>Unspecified</description>
          <addressOffset>0xF10</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK_TRIG_ZERO_PENALTY_PCP_2</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_TRIG_FULL_PENALTY_PCP_2</name>
          <description>Unspecified</description>
          <addressOffset>0xF14</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK_TRIG_FULL_PENALTY_PCP_2</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_TRIG_ZERO_PENALTY_PCP_1</name>
          <description>Unspecified</description>
          <addressOffset>0xF18</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK_TRIG_ZERO_PENALTY_PCP_1</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_TRIG_FULL_PENALTY_PCP_1</name>
          <description>Unspecified</description>
          <addressOffset>0xF1C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK_TRIG_FULL_PENALTY_PCP_1</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_TRIG_ZERO_PENALTY_PCP_0</name>
          <description>Unspecified</description>
          <addressOffset>0xF20</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK_TRIG_ZERO_PENALTY_PCP_0</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_TRIG_FULL_PENALTY_PCP_0</name>
          <description>Unspecified</description>
          <addressOffset>0xF24</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASK_TRIG_FULL_PENALTY_PCP_0</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PENALTY_RG_PCP_0</name>
          <description>Unspecified</description>
          <addressOffset>0xF28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIELD0</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PENALTY_RG_PCP_1</name>
          <description>Unspecified</description>
          <addressOffset>0xF2C</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFC</resetValue>
          <fields>
            <field>
              <name>FIELD0</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PENALTY_RG_PCP_2</name>
          <description>Unspecified</description>
          <addressOffset>0xF30</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFC</resetValue>
          <fields>
            <field>
              <name>FIELD0</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PENALTY_RG_PCP_3</name>
          <description>Unspecified</description>
          <addressOffset>0xF34</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFC</resetValue>
          <fields>
            <field>
              <name>FIELD0</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PENALTY_RG_PCP_4</name>
          <description>Unspecified</description>
          <addressOffset>0xF38</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFC</resetValue>
          <fields>
            <field>
              <name>FIELD0</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TURN_OFF_AUTO_CLOCKSOURCE_REQ</name>
          <description>Unspecified</description>
          <addressOffset>0xF3C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIELD0</name>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCE_OVERRIDE_PCP_0</name>
          <description>Unspecified</description>
          <addressOffset>0xF40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIELD0</name>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>FIELD1</name>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCE_OVERRIDE_PCP_1</name>
          <description>Unspecified</description>
          <addressOffset>0xF44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIELD0</name>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>FIELD1</name>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCE_OVERRIDE_PCP_2</name>
          <description>Unspecified</description>
          <addressOffset>0xF48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIELD0</name>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>FIELD1</name>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCE_OVERRIDE_PCP_3</name>
          <description>Unspecified</description>
          <addressOffset>0xF4C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIELD0</name>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>FIELD1</name>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCE_OVERRIDE_PCP_4</name>
          <description>Unspecified</description>
          <addressOffset>0xF50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIELD0</name>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>FIELD1</name>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
