adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENDCONFIG</name>
              <description>Write '1' to disable interrupt for event ENDCONFIG</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENDCRYPT</name>
              <description>Write '1' to disable interrupt for event ENDCRYPT</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERROR</name>
              <description>Write '1' to disable interrupt for event ERROR</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MACSTATUS</name>
          <description>MAC check result</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>MACSTATUS</name>
              <description>The result of the MAC check performed during the previous decryption operation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CheckFailed</name>
                  <description>MAC check failed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CheckPassed</name>
                  <description>MAC check passed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERRORSTATUS</name>
          <description>Error status</description>
          <addressOffset>0x404</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>ERRORSTATUS</name>
              <description>Error status when the ERROR event is generated</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoError</name>
                  <description>No errors have occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PrematureInptrEnd</name>
                  <description>End of INPTR job list before CCM data structure was read.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PrematureOutptrEnd</name>
                  <description>End of OUTPTR job list before CCM data structure was read.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EncryptionTooSlow</name>
                  <description>Encryption of the unencrypted CCM data structure did not complete in time.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>Enable</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable CCM</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>Operation mode</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>MODE</name>
              <description>The mode of operation to be used. The settings in this register apply when the CRYPT task is triggered.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Encryption</name>
                  <description>AES CCM packet encryption mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Decryption</name>
                  <description>AES CCM packet decryption mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FastDecryption</name>
                  <description>AES fast decrypt mode. This mode will run CCM decryption as fast as possible, i.e. not locked to a radio data rate. This can be used when a packet has been completely received.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROTOCOL</name>
              <description>Protocols that uses Crypto IP Due to the differences in BLE and 802.15.4 packets, HW needs to have a separation between them.</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCM_BLE</name>
                  <description>BLE packet format</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCM_154</name>
                  <description>802.15.4 packet format</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATARATE</name>
              <description>Radio data rate that the CCM shall run synchronous with</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>125Kbit</name>
                  <description>125 Kbps</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>250Kbit</name>
                  <description>250 Kbps</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500Kbps</name>
                  <description>500 Kbps</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1Mbps</name>
                  <description>1 Mbps</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2Mbit</name>
                  <description>2 Mbps</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4Mbit</name>
                  <description>4 Mbps</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MANUALDATARATE</name>
              <description>When enabled, the INPTR data structure will process one byte each time the PROCESS task is triggered. This can be used to support various data rates for on-the-fly encryption/decryption modes.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable manual data rate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable manual data rate</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MACLEN</name>
              <description>CCM MAC length (bytes)</description>
              <lsb>24</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M0</name>
                  <description>M = 0 This is a special case for CCM* where encryption is required but not authentication</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4</name>
                  <description>M = 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M6</name>
                  <description>M = 6</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M8</name>
                  <description>M = 8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M10</name>
                  <description>M = 10</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M12</name>
                  <description>M = 12</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M14</name>
                  <description>M = 14</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M16</name>
                  <description>M = 16</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>KEY</name>
          <description>Unspecified</description>
          <headerStructName>CCM_KEY</headerStructName>
          <access>read-write</access>
          <addressOffset>0x510</addressOffset>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>VALUE[%s]</name>
            <description>Description collection: 128-bit AES key</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VALUE</name>
                <description>AES 128-bit key value, bits (32*(i+1))-1 : (32*i)</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>NONCE</name>
          <description>Unspecified</description>
          <headerStructName>CCM_NONCE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x520</addressOffset>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>VALUE[%s]</name>
            <description>Description collection: 13-byte NONCE vector Only the lower 13 bytes are used</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VALUE</name>
                <description>NONCE value, bits (32*(i+1))-1 : (32*i)</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>INPTR</name>
          <description>Input pointer Points to a job list containing unencrypted CCM data structure in Encryption mode Points to a job list containing encrypted CCM data structure in Decryption mode</description>
          <addressOffset>0x530</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INPTR</name>
              <description>Input pointer</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>INAMOUNT</name>
          <description>Number of bytes read from the input data, not including the job list structure</description>
          <addressOffset>0x534</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>INAMOUNT</name>
              <description>Number of bytes read from the input data</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTPTR</name>
          <description>Output pointer Points to a job list containing encrypted CCM data structure in Encryption mode Points to a job list containing decrypted CCM data structure in Decryption mode</description>
          <addressOffset>0x538</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OUTPTR</name>
              <description>Output pointer</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTAMOUNT</name>
          <description>Number of bytes available in the output data, not including the job list structure</description>
          <addressOffset>0x53C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>OUTAMOUNT</name>
              <description>Number of bytes available in the output data</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RATEOVERRIDE</name>
          <description>Data rate override setting.</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RATEOVERRIDE</name>
              <description>Data rate override setting.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1Mbit</name>
                  <description>1 Mbps</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2Mbit</name>
                  <description>2 Mbps</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>125Kbps</name>
                  <description>125 Kbps</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500Kbps</name>
                  <description>500 Kbps</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4Mbit</name>
                  <description>4 Mbps</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADATAMASK</name>
          <description>CCM adata mask.</description>
          <addressOffset>0x544</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000E3</resetValue>
          <fields>
            <field>
              <name>ADATAMASK</name>
              <description>CCM adata mask. The rationale for this is to support on-the-fly masking of BLE header, as per the Bluetooth Spec.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
