adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
        <register>
          <name>SAMPLERATE</name>
          <description>Controls normal or continuous sample rate</description>
          <addressOffset>0x5F8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CC</name>
              <description>Capture and compare value. Sample rate is 16 MHz/CC</description>
              <lsb>0</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>MODE</name>
              <description>Select mode for sample rate control</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Task</name>
                  <description>Rate is controlled from SAMPLE task</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Timers</name>
                  <description>Rate is controlled from local timer (use CC to control the rate)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>RESULT</name>
          <description>RESULT EasyDMA channel</description>
          <headerStructName>SAADC_RESULT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x62C</addressOffset>
          <register>
            <name>PTR</name>
            <description>Data pointer</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Maximum number of buffer bytes to transfer</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of buffer bytes to transfer</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Number of buffer bytes transferred since last START</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of buffer bytes transferred since last START. This register can be read after an END or STOPPED event.</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>TESTCTRL</name>
          <description>Control signals used during test of ADC</description>
          <addressOffset>0x63C</addressOffset>
          <access>read-write</access>
          <resetValue>0x10000000</resetValue>
          <fields>
            <field>
              <name>ICTRL</name>
              <description>Current control. See design description for coding</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>SWITCH</name>
              <description>Swap positive and negative input. See design description for coding</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>SHORT</name>
              <description>Short input. Used to measure offset of ADC. See design description for coding</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>TST</name>
              <description>Test bus for ADC core. See design description for coding</description>
              <lsb>12</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>ATB</name>
              <description>Analog testbus control. See design description for coding</description>
              <lsb>20</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>ENINMUX</name>
              <description>Will enable the input mux in the ADC, so the resistor strings can be connected even when the analog core is powered down. See design description for coding</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>PWRUP</name>
              <description>Power-up time</description>
              <lsb>28</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>6us</name>
                  <description>6 us</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10us</name>
                  <description>10 us</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15us</name>
                  <description>15 us</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20us</name>
                  <description>20 us</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CALOFFSET</name>
          <description>Calibration control for offset error</description>
          <addressOffset>0x640</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CALOFFSET</name>
              <description>Sign-magnitude coding</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Default setting</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MaxPos</name>
                  <description>Maximum positive offset</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MaxNeg</name>
                  <description>maximum negative offset</description>
                  <value>0x20</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CALGAIN</name>
          <description>Calibration control for gain error</description>
          <addressOffset>0x644</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CALGAIN</name>
              <description>Offset binary coding</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Default gain, for +1/2 input (assume full-scale = +-1) the output will be 1024</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>High gain setting</description>
                  <value>0x3F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Low gain setting</description>
                  <value>0x40</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CALVREF</name>
          <description>Calibration control for reference voltage</description>
          <addressOffset>0x648</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CALVREF</name>
              <description>Offset binary coding</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Default vref, in typical corner VREF=1.2V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Low output code (high reference voltage)</description>
                  <value>0x3F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Low</name>
                  <description>High output code (low reference voltage)</description>
                  <value>0x40</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CALIREF</name>
          <description>Calibration control for reference current</description>
          <addressOffset>0x64C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CALIREF</name>
              <description>Calibration control for reference current. See design description for coding</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CALVREFTC</name>
          <description>Calibration code for reference temperature coefficient</description>
          <addressOffset>0x650</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CALVREFTC</name>
              <description>Calibration code for reference temperature coefficient. See design description for coding</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NOISESHAPE</name>
          <description>Enable noise shaping</description>
          <addressOffset>0x654</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>NOISESHAPE</name>
              <description>Enable noise shaping</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Oversampling based on accumulate and average. Used in high-speed mode (10-bit)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Oversampling based on noise shaping. Used in  high-accuracy modes (12-bit and 14-bit)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EASYDMAMODE</name>
          <description>Configure EasyDMA mode.</description>
          <addressOffset>0x658</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>LPOP</name>
              <description>Enable low-power operation, or use low-latency</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LowLat</name>
                  <description>Low-latency operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LowPower</name>
                  <description>Low-power operation</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TERMINATEONAHBERROR</name>
          <description>Enable EasyDMA termination on AHB error</description>
          <addressOffset>0x660</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable termination on AHB error</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Termination on AHB error disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Termination on AHB error enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBERRORADDRESS</name>
          <description>Address of the last AHB error transaction</description>
          <addressOffset>0x664</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>Address</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
