adamkondraciuk/nrfx/mdk/nrf54lilium_network.svd
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DETECTMODE</name>
          <description>Select between default DETECT signal behavior and LDETECT mode (For non-secure pin only)</description>
          <addressOffset>0x024</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DETECTMODE</name>
              <description>Select between default DETECT signal behavior and LDETECT mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>DETECT directly connected to PIN DETECT signals</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDETECT</name>
                  <description>Use the latched LDETECT behavior</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DETECTMODE_SEC</name>
          <description>Select between default DETECT signal behavior and LDETECT mode (For secure pin only)</description>
          <addressOffset>0x028</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DETECTMODE</name>
              <description>Select between default DETECT signal behavior and LDETECT mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>DETECT directly connected to PIN DETECT signals</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDETECT</name>
                  <description>Use the latched LDETECT behavior</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>32</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>PIN[%s]</name>
          <description>Pin n direct access</description>
          <headerStructName>GPIO_PIN</headerStructName>
          <access>read-write</access>
          <addressOffset>0x100</addressOffset>
          <register>
            <name>OUT</name>
            <description>Description cluster: Pin n direct access output register</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>OUT</name>
                <description>Direct access</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IN</name>
            <description>Description cluster: Pin n direct access input register</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>IN</name>
                <description>Direct access</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PIN_CNF[%s]</name>
          <description>Description collection: Configuration of GPIO pins</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>DIR</name>
              <description>Pin direction. Same physical register as DIR register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Configure pin as an input pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Configure pin as an output pin</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPUT</name>
              <description>Connect or disconnect input buffer</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Connect</name>
                  <description>Connect input buffer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disconnect</name>
                  <description>Disconnect input buffer</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULL</name>
              <description>Pull configuration</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No pull</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pulldown</name>
                  <description>Pull down on pin</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pullup</name>
                  <description>Pull up on pin</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRIVE</name>
              <description>Drive configuration</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S0S1</name>
                  <description>Standard '0', standard '1'</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H0S1</name>
                  <description>High drive '0', standard '1'</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S0H1</name>
                  <description>Standard '0', high drive '1'</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H0H1</name>
                  <description>High drive '0', high 'drive '1''</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D0S1</name>
                  <description>Disconnect '0', standard '1' (normally used for wired-or connections)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D0H1</name>
                  <description>Disconnect '0', high drive '1' (normally used for wired-or connections)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S0D1</name>
                  <description>Standard '0', disconnect '1' (normally used for wired-and connections)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H0D1</name>
                  <description>High drive '0', disconnect '1' (normally used for wired-and connections)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E0S1</name>
                  <description>Extra high drive '0', standard '1'</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S0E1</name>
                  <description>Standard '0', extra high drive '1'</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E0E1</name>
                  <description>Extra high drive '0', extra high drive '1'</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D0E1</name>
                  <description>Disconnect '0', extra high drive '1' (normally used for wired-or connections)</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E0D1</name>
                  <description>Extra high drive '0', disconnect '1' (normally used for wired-and connections)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SENSE</name>
              <description>Pin sensing mechanism</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Sense for high level</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Sense for low level</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANAEN</name>
              <description>Override of analog mux enable signals for pads with analog functionality</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Override of analog mux is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AE0</name>
                  <description>Enable analog signal 0 (analog test bus)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCUSEL</name>
              <description>Select which MCU/Subsystem controls this pin Note: this field is only accessible from secure code.</description>
              <lsb>28</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AppMCU</name>
                  <description>Application MCU</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NetworkMCU</name>
                  <description>Network MCU</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Peripheral</name>
                  <description>Peripheral with dedicated pins</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TND</name>
                  <description>Trace and Debug Subsystem</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>